mspm0-rs/mspm0-data-sources/svd/MSPM0G511X.svd
                    <register>
                        <name>TIMA0_DBCTL</name>
                        <description>Dead Band insertion control register</description>
                        <addressOffset>0xA4</addressOffset>
                        <size>32</size>
                        <access>read-write</access>
                        <fields>
                            <field>
                                <name>RISEDELAY</name>
                                <description>Rise Delay
The number of TIMCLK periods inserted between the fall edge of CCP signal and the rise edge of CCP complimentary signal.</description>
                                <bitOffset>0x0</bitOffset>
                                <bitWidth>0xC</bitWidth>
                                </field>
                            <field>
                                <name>FALLDELAY</name>
                                <description>Fall Delay
The number of TIMCLK periods inserted between the fall edge of CCP signal and the rise edge of CCP complimentary signal.</description>
                                <bitOffset>0x10</bitOffset>
                                <bitWidth>0xC</bitWidth>
                                </field>
                            <field>
                                <name>M1_ENABLE</name>
                                <description>Dead Band Mode 1 Enable.</description>
                                <bitOffset>0xC</bitOffset>
                                <bitWidth>0x1</bitWidth>
                                <access>read-write</access>
                                <enumeratedValues>
                                        <enumeratedValue>
                                            <name>DISABLED</name>
                                            <description>Disabled</description>
                                            <value>0x0</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>ENABLED</name>
                                            <description>Enabled</description>
                                            <value>0x1</value>
                                        </enumeratedValue>
                                    </enumeratedValues>
                                </field>
                        </fields>
                    </register>
                    <register>
                        <name>TIMA0_TSEL</name>
                        <description>Trigger Select Register</description>
                        <addressOffset>0xB0</addressOffset>
                        <size>32</size>
                        <access>read-write</access>
                        <resetValue>0x00000000</resetValue>
                        <resetMask>0xffffffff</resetMask>
                        <fields>
                            <field>
                                <name>ETSEL</name>
                                <description>External Trigger Select. #br# This selects which System Event is used if the input filter selects trigger.  
Triggers 0-15 are used to connect triggers generated by other timer modules. Refer to the SoC datasheet for details related to timer trigger sources.
Triggers 16 and  17 are connected to event manager subscriber ports.
Event lines 18-31 are reserved for future use.</description>
                                <bitOffset>0x0</bitOffset>
                                <bitWidth>0x5</bitWidth>
                                <access>read-write</access>
                                <enumeratedValues>
                                        <enumeratedValue>
                                            <name>TRIG0</name>
                                            <description>TRIGx = External trigger input from TIM x.</description>
                                            <value>0x0</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>TRIG1</name>
                                            <description>TRIGx = External trigger input from TIM x.</description>
                                            <value>0x1</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>TRIG2</name>
                                            <description>TRIGx = External trigger input from TIM x.</description>
                                            <value>0x2</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>TRIG3</name>
                                            <description>TRIGx = External trigger input from TIM x.</description>
                                            <value>0x3</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>TRIG4</name>
                                            <description>TRIGx = External trigger input from TIM x.</description>
                                            <value>0x4</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>TRIG5</name>
                                            <description>TRIGx = External trigger input from TIM x.</description>
                                            <value>0x5</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>TRIG6</name>
                                            <description>TRIGx = External trigger input from TIM x.</description>
                                            <value>0x6</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>TRIG7</name>
                                            <description>TRIGx = External trigger input from TIM x.</description>
                                            <value>0x7</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>TRIG8</name>
                                            <description>TRIGx = External trigger input from TIM x.</description>
                                            <value>0x8</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>TRIG9</name>
                                            <description>TRIGx = External trigger input from TIM x.</description>
                                            <value>0x9</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>TRIG10</name>
                                            <description>TRIGx = External trigger input from TIM x.</description>
                                            <value>0xA</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>TRIG11</name>
                                            <description>TRIGx = External trigger input from TIM x.</description>
                                            <value>0xB</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>TRIG12</name>
                                            <description>TRIGx = External trigger input from TIM x.</description>
                                            <value>0xC</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>TRIG13</name>
                                            <description>TRIGx = External trigger input from TIM x.</description>
                                            <value>0xD</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>TRIG14</name>
                                            <description>TRIGx = External trigger input from TIM x.</description>
                                            <value>0xE</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>TRIG15</name>
                                            <description>TRIGx = External trigger input from TIM x.</description>
                                            <value>0xF</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>TRIG_SUB0</name>
                                            <description>TRIG_SUBx = External trigger input from subscriber port x.</description>
                                            <value>0x10</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>TRIG_SUB1</name>
                                            <description>TRIG_SUBx = External trigger input from subscriber port x.</description>
                                            <value>0x11</value>
                                        </enumeratedValue>
                                    </enumeratedValues>
                                </field>
                            <field>
                                <name>TE</name>
                                <description>Trigger Enable.
This selects whether a trigger is enabled or not for this counter  
0x0 = Triggers are not used 
0x1 = Triggers are used as selected by the ETSEL field</description>
                                <bitOffset>0x9</bitOffset>
                                <bitWidth>0x1</bitWidth>
                                <access>read-write</access>
                                <enumeratedValues>
                                        <enumeratedValue>
                                            <name>DISABLED</name>
                                            <description>Triggers are not used.</description>
                                            <value>0x0</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>ENABLED</name>
                                            <description>Triggers are used as selected by the IE, ITSEL and ETSEL fields.</description>
                                            <value>0x1</value>
                                        </enumeratedValue>
                                    </enumeratedValues>
                                </field>
                        </fields>
                    </register>
                    <register>
                        <name>TIMA0_RC</name>
                        <description>Repeat counter Register</description>
                        <addressOffset>0xB4</addressOffset>
                        <size>32</size>
                        <access>read-only</access>
                        <resetValue>0x00000000</resetValue>
                        <resetMask>0xffffffff</resetMask>
                        <fields>
                            <field>
                                <name>RC</name>
                                <description>Repeat Counter Value</description>
                                <bitOffset>0x0</bitOffset>
                                <bitWidth>0x8</bitWidth>
                                <access>read-only</access>
                                </field>
                        </fields>
                    </register>
                    <register>
                        <name>TIMA0_RCLD</name>
                        <description>Repeat counter load Register</description>
                        <addressOffset>0xB8</addressOffset>
                        <size>32</size>
                        <access>read-write</access>
                        <resetValue>0x00000000</resetValue>
                        <resetMask>0xffffffff</resetMask>
                        <fields>
                            <field>
                                <name>RCLD</name>
                                <description>Repeat Counter Load Value
This field provides the value loaded into the
repeat counter at a load event following the
repeat counter value equaling 0.</description>
                                <bitOffset>0x0</bitOffset>
                                <bitWidth>0x8</bitWidth>
                                <access>read-write</access>
                                </field>
                        </fields>
                    </register>
