mspm0-rs/mspm0-data-sources/svd/MSPM0G511X.svd
                <register>
                    <name>DMA_EVT_MODE</name>
                    <description>Event Mode</description>
                    <addressOffset>0x10E0</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <fields>
                        <field>
                            <name>INT0_CFG</name>
                            <description>Event line mode select for event corresponding to interrupt event CPU_INT</description>
                            <bitOffset>0x0</bitOffset>
                            <bitWidth>0x2</bitWidth>
                            <access>read-only</access>
                            <enumeratedValues>
                                    <enumeratedValue>
                                        <name>DISABLE</name>
                                        <description>The interrupt or event line is disabled.</description>
                                        <value>0x0</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>SOFTWARE</name>
                                        <description>The interrupt or event line is in software mode. Software must clear the RIS.</description>
                                        <value>0x1</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>HARDWARE</name>
                                        <description>The interrupt or event line is in hardware mode. The hardware (another module) clears automatically the associated RIS flag.</description>
                                        <value>0x2</value>
                                    </enumeratedValue>
                                </enumeratedValues>
                            </field>
                        <field>
                            <name>EVT1_CFG</name>
                            <description>Event line mode select for event corresponding to generic event  GEN_EVENT</description>
                            <bitOffset>0x2</bitOffset>
                            <bitWidth>0x2</bitWidth>
                            <access>read-only</access>
                            <enumeratedValues>
                                    <enumeratedValue>
                                        <name>DISABLE</name>
                                        <description>The interrupt or event line is disabled.</description>
                                        <value>0x0</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>SOFTWARE</name>
                                        <description>The interrupt or event line is in software mode. Software must clear the RIS.</description>
                                        <value>0x1</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>HARDWARE</name>
                                        <description>The interrupt or event line is in hardware mode. The hardware (another module) clears automatically the associated RIS flag.</description>
                                        <value>0x2</value>
                                    </enumeratedValue>
                                </enumeratedValues>
                            </field>
                    </fields>
                </register>
                <register>
                    <name>DMA_DESC</name>
                    <description>Module Description</description>
                    <addressOffset>0x10FC</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <fields>
                        <field>
                            <name>MINREV</name>
                            <description>Minor rev of the IP</description>
                            <bitOffset>0x0</bitOffset>
                            <bitWidth>0x4</bitWidth>
                            </field>
                        <field>
                            <name>MAJREV</name>
                            <description>Major rev of the IP</description>
                            <bitOffset>0x4</bitOffset>
                            <bitWidth>0x4</bitWidth>
                            </field>
                        <field>
                            <name>FEATUREVER</name>
                            <description>Feature Set for the DMA: number of DMA channel minus one  (e.g. 0-&gt;1ch, 2-&gt;3ch, 15-&gt;16ch).</description>
                            <bitOffset>0xC</bitOffset>
                            <bitWidth>0x4</bitWidth>
                            </field>
                        <field>
                            <name>MODULEID</name>
                            <description>Module identification contains a unique peripheral identification number. The assignments are maintained in a central database for all of the platform modules to ensure uniqueness.</description>
                            <bitOffset>0x10</bitOffset>
                            <bitWidth>0x10</bitWidth>
                            </field>
                    </fields>
                </register>
                <register>
                    <name>DMA_DMAPRIO</name>
                    <description>DMA Channel Priority Control</description>
                    <addressOffset>0x1100</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <fields>
                        <field>
                            <name>ROUNDROBIN</name>
                            <description>Round robin. This bit enables the round-robin DMA channel priorities.</description>
                            <bitOffset>0x0</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <enumeratedValues>
                                    <enumeratedValue>
                                        <name>DISABLE</name>
                                        <description>Roundrobin priority disabled, DMA channel priority is fixed: DMA0-DMA1-DMA2-...-DMA16</description>
                                        <value>0x0</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>ENABLE</name>
                                        <description>Roundrobin priority enabled, DMA channel priority changes with each transfer</description>
                                        <value>0x1</value>
                                    </enumeratedValue>
                                </enumeratedValues>
                            </field>
                        <field>
                            <name>BURSTSZ</name>
                            <description>Define the burst size of a block transfer, before the priority is re-evaluated</description>
                            <bitOffset>0x10</bitOffset>
                            <bitWidth>0x2</bitWidth>
                            <enumeratedValues>
                                    <enumeratedValue>
                                        <name>INFINITI</name>
                                        <description>There is no burst size, the whole block transfer is completed on one transfer without interruption</description>
                                        <value>0x0</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>BURST_8</name>
                                        <description>The burst size is 8, after 9 transfers the block transfer is interrupted and the priority is reevaluated</description>
                                        <value>0x1</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>BUSRT_16</name>
                                        <description>The burst size is 16, after 17 transfers the block transfer is interrupted and the priority is reevaluated</description>
                                        <value>0x2</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>BURST_32</name>
                                        <description>The burst size is 32, after 33 transfers the block transfer is interrupted and the priority is reevaluated</description>
                                        <value>0x3</value>
                                    </enumeratedValue>
                                </enumeratedValues>
                            </field>
                    </fields>
                </register>
                <cluster>
                    <dim>12</dim>
                    <dimIncrement>4</dimIncrement>
                    <dimArrayIndex>0,1,2,3,4,5,6,7,8,9,10,11</dimArrayIndex>
                    <name>DMA_DMATRIG[%s]</name>
                    <description></description>
                    <addressOffset>0x1110</addressOffset>
                    <register>
                        <name>DMA_DMATCTL</name>
                        <description>DMA Trigger Select</description>
                        <addressOffset>0x0</addressOffset>
                        <size>32</size>
                        <access>read-write</access>
                        <fields>
                            <field>
                                <name>DMATSEL</name>
                                <description>DMA Trigger Select 

