mspm0-rs/mspm0-data-sources/svd/MSPM0G511X.svd
                <register>
                    <name>SYSCTL_HSCLKCFG</name>
                    <description>High-speed clock (HSCLK) source selection</description>
                    <addressOffset>0x110C</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0x00000003</resetMask>
                    <fields>
                        <field>
                            <name>USBFLL4HSCLK</name>
                            <description>USBFLL4HSCLK selects the USBFLL as High Speed clock source</description>
                            <bitOffset>0x1</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>read-write</access>
                            <enumeratedValues>
                                    <enumeratedValue>
                                        <name>SYSPLL-HFCLK</name>
                                        <description>HSCLK is sourced from the HSCLKCFG.HSCLKSEL</description>
                                        <value>0x0</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>USBFLL</name>
                                        <description>HSCLK is sourced from the USBFLL</description>
                                        <value>0x1</value>
                                    </enumeratedValue>
                                </enumeratedValues>
                            </field>
                        <field>
                            <name>HSCLKSEL</name>
                            <description>HSCLKSEL selects the HSCLK source (SYSPLL or HFCLK).</description>
                            <bitOffset>0x0</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>read-write</access>
                            <enumeratedValues>
                                    <enumeratedValue>
                                        <name>SYSPLL</name>
                                        <description>HSCLK is sourced from the SYSPLL</description>
                                        <value>0x0</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>HFCLKCLK</name>
                                        <description>HSCLK is sourced from the HFCLK</description>
                                        <value>0x1</value>
                                    </enumeratedValue>
                                </enumeratedValues>
                            </field>
                    </fields>
                </register>
                <register>
                    <name>SYSCTL_HFCLKCLKCFG</name>
                    <description>High-frequency clock (HFCLK) configuration</description>
                    <addressOffset>0x1110</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x10000000</resetValue>
                    <resetMask>0x100030ff</resetMask>
                    <fields>
                        <field>
                            <name>HFXTTIME</name>
                            <description>HFXTTIME specifies the HFXT startup time in 64us resolution.  If the HFCLK startup monitor is enabled (HFCLKFLTCHK), HFXT will be checked after this time expires.</description>
                            <bitOffset>0x0</bitOffset>
                            <bitWidth>0x8</bitWidth>
                            <access>read-write</access>
                            <enumeratedValues>
                                    <enumeratedValue>
                                        <name>MINSTARTTIME</name>
                                        <description>Minimum startup time (approximatly zero)</description>
                                        <value>0x0</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>MAXSTARTTIME</name>
                                        <description>Maximum startup time (approximatly 16.32ms)</description>
                                        <value>0xFF</value>
                                    </enumeratedValue>
                                </enumeratedValues>
                            </field>
                        <field>
                            <name>HFCLKFLTCHK</name>
                            <description>HFCLKFLTCHK enables or disables the HFCLK startup monitor.</description>
                            <bitOffset>0x1C</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>read-write</access>
                            <enumeratedValues>
                                    <enumeratedValue>
                                        <name>DISABLE</name>
                                        <description>HFCLK startup is not checked</description>
                                        <value>0x0</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>ENABLE</name>
                                        <description>HFCLK startup is checked</description>
                                        <value>0x1</value>
                                    </enumeratedValue>
                                </enumeratedValues>
                            </field>
                        <field>
                            <name>HFXTRSEL</name>
                            <description>HFXT Range Select</description>
                            <bitOffset>0xC</bitOffset>
                            <bitWidth>0x2</bitWidth>
                            <access>read-write</access>
                            <enumeratedValues>
                                    <enumeratedValue>
                                        <name>RANGE4TO8</name>
                                        <description>4MHz &lt;= HFXT frequency &lt;= 8MHz</description>
                                        <value>0x0</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>RANGE8TO16</name>
                                        <description>8MHz &lt; HFXT frequency &lt;= 16MHz</description>
                                        <value>0x1</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>RANGE16TO32</name>
                                        <description>16MHz &lt; HFXT frequency &lt;= 32MHz</description>
                                        <value>0x2</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>RANGE32TO48</name>
                                        <description>32MHz &lt; HFXT frequency &lt;= 48MHz</description>
                                        <value>0x3</value>
                                    </enumeratedValue>
                                </enumeratedValues>
                            </field>
                    </fields>
                </register>
                <register>
                    <name>SYSCTL_LFCLKCFG</name>
                    <description>Low frequency crystal oscillator (LFXT) configuration</description>
                    <addressOffset>0x1114</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000003</resetValue>
                    <resetMask>0x00000113</resetMask>
                    <fields>
                        <field>
                            <name>XT1DRIVE</name>
                            <description>XT1DRIVE selects the low frequency crystal oscillator (LFXT) drive strength.</description>
                            <bitOffset>0x0</bitOffset>
                            <bitWidth>0x2</bitWidth>
                            <access>read-write</access>
                            <enumeratedValues>
                                    <enumeratedValue>
                                        <name>LOWESTDRV</name>
                                        <description>Lowest drive and current</description>
                                        <value>0x0</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>LOWERDRV</name>
                                        <description>Lower drive and current</description>
                                        <value>0x1</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>HIGHERDRV</name>
                                        <description>Higher drive and current</description>
                                        <value>0x2</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>HIGHESTDRV</name>
                                        <description>Highest drive and current</description>
                                        <value>0x3</value>
                                    </enumeratedValue>
                                </enumeratedValues>
                            </field>
                        <field>
                            <name>MONITOR</name>
                            <description>MONITOR enables or disables the LFCLK monitor, which continuously checks LFXT or LFCLK_IN for a clock stuck fault.</description>
                            <bitOffset>0x4</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>read-write</access>
                            <enumeratedValues>
                                    <enumeratedValue>
                                        <name>DISABLE</name>
                                        <description>Clock monitor is disabled</description>
                                        <value>0x0</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>ENABLE</name>
                                        <description>Clock monitor is enabled</description>
                                        <value>0x1</value>
                                    </enumeratedValue>
                                </enumeratedValues>
                            </field>
                        <field>
                            <name>LOWCAP</name>
                            <description>LOWCAP controls the low-power LFXT mode.  When the LFXT load capacitance is less than 3pf, LOWCAP may be set for reduced power consumption.</description>
                            <bitOffset>0x8</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>read-write</access>
                            <enumeratedValues>
                                    <enumeratedValue>
                                        <name>DISABLE</name>
                                        <description>LFXT low capacitance mode is disabled</description>
                                        <value>0x0</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>ENABLE</name>
                                        <description>LFXT low capacitance mode is enabled</description>
                                        <value>0x1</value>
                                    </enumeratedValue>
                                </enumeratedValues>
                            </field>
                    </fields>
                </register>
