mspm0-rs/mspm0-data-sources/svd/MSPM0G511X.svd
                                        <name>ENABLE</name>
                                        <description>Clock divider is enabled (EXCLKDIVVAL is applied)</description>
                                        <value>0x1</value>
                                    </enumeratedValue>
                                </enumeratedValues>
                            </field>
                    </fields>
                </register>
                <register>
                    <name>SYSCTL_GENCLKEN</name>
                    <description>General clock enable control</description>
                    <addressOffset>0x113C</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0x00000011</resetMask>
                    <fields>
                        <field>
                            <name>EXCLKEN</name>
                            <description>EXCLKEN enables the CLK_OUT external clock output block.</description>
                            <bitOffset>0x0</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>read-write</access>
                            <enumeratedValues>
                                    <enumeratedValue>
                                        <name>DISABLE</name>
                                        <description>CLK_OUT block is disabled</description>
                                        <value>0x0</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>ENABLE</name>
                                        <description>CLK_OUT block is enabled</description>
                                        <value>0x1</value>
                                    </enumeratedValue>
                                </enumeratedValues>
                            </field>
                        <field>
                            <name>MFPCLKEN</name>
                            <description>MFPCLKEN enables the middle frequency precision clock (MFPCLK).</description>
                            <bitOffset>0x4</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>read-write</access>
                            <enumeratedValues>
                                    <enumeratedValue>
                                        <name>DISABLE</name>
                                        <description>MFPCLK is disabled</description>
                                        <value>0x0</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>ENABLE</name>
                                        <description>MFPCLK is enabled</description>
                                        <value>0x1</value>
                                    </enumeratedValue>
                                </enumeratedValues>
                            </field>
                    </fields>
                </register>
                <register>
                    <name>SYSCTL_PMODECFG</name>
                    <description>Power mode configuration</description>
                    <addressOffset>0x1140</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0x00000003</resetMask>
                    <fields>
                        <field>
                            <name>DSLEEP</name>
                            <description>DSLEEP selects the operating mode to enter upon a DEEPSLEEP request from the CPU.</description>
                            <bitOffset>0x0</bitOffset>
                            <bitWidth>0x2</bitWidth>
                            <access>read-write</access>
                            <enumeratedValues>
                                    <enumeratedValue>
                                        <name>STOP</name>
                                        <description>STOP mode is entered</description>
                                        <value>0x0</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>STANDBY</name>
                                        <description>STANDBY mode is entered</description>
                                        <value>0x1</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>SHUTDOWN</name>
                                        <description>SHUTDOWN mode is entered</description>
                                        <value>0x2</value>
                                    </enumeratedValue>
                                </enumeratedValues>
                            </field>
                    </fields>
                </register>
                <register>
                    <name>SYSCTL_FCC</name>
                    <description>Frequency clock counter (FCC) count</description>
                    <addressOffset>0x1150</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0x003fffff</resetMask>
                    <fields>
                        <field>
                            <name>DATA</name>
                            <description>Frequency clock counter (FCC) count value.</description>
                            <bitOffset>0x0</bitOffset>
                            <bitWidth>0x16</bitWidth>
                            <access>read-only</access>
                            </field>
                    </fields>
                </register>
                <register>
                    <name>SYSCTL_SYSOSCTRIMUSER</name>
                    <description>SYSOSC user-specified trim</description>
                    <addressOffset>0x1170</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0x1fff3f73</resetMask>
                    <fields>
                        <field>
                            <name>RESCOARSE</name>
                            <description>RESCOARSE specifies the resister coarse trim.  This value changes with the target frequency.</description>
                            <bitOffset>0x8</bitOffset>
                            <bitWidth>0x6</bitWidth>
                            <access>read-write</access>
                            </field>
                        <field>
                            <name>RESFINE</name>
                            <description>RESFINE specifies the resister fine trim.  This value changes with the target frequency.</description>
                            <bitOffset>0x10</bitOffset>
                            <bitWidth>0x4</bitWidth>
                            <access>read-write</access>
                            </field>
                        <field>
                            <name>RDIV</name>
                            <description>RDIV specifies the frequency correction loop (FCL) resistor trim.  This value changes with the target frequency.</description>
                            <bitOffset>0x14</bitOffset>
                            <bitWidth>0x9</bitWidth>
                            <access>read-write</access>
                            </field>
                        <field>
                            <name>FREQ</name>
                            <description>FREQ specifies the target user-trimmed frequency for SYSOSC.</description>
                            <bitOffset>0x0</bitOffset>
                            <bitWidth>0x2</bitWidth>
                            <access>read-write</access>
                            <enumeratedValues>
                                    <enumeratedValue>
                                        <name>SYSOSC16M</name>
                                        <description>16MHz user frequency</description>
                                        <value>0x1</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>SYSOSC24M</name>
                                        <description>24MHz user frequency</description>
                                        <value>0x2</value>
                                    </enumeratedValue>
                                </enumeratedValues>
                            </field>
                        <field>
                            <name>CAP</name>
                            <description>CAP specifies the SYSOSC capacitor trim.  This value changes with the target frequency.</description>
                            <bitOffset>0x4</bitOffset>
                            <bitWidth>0x3</bitWidth>
                            <access>read-write</access>
                            </field>
                    </fields>
                </register>
                <register>
                    <name>SYSCTL_SRAMBOUNDARY</name>
                    <description>SRAM Write Boundary</description>
                    <addressOffset>0x1178</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0x000fffe0</resetMask>
                    <fields>
                        <field>
                            <name>ADDR</name>
                            <description>SRAM boundary configuration. The value configured into this acts such that: SRAM accesses to addresses less than or equal value will be RW only. SRAM accesses to addresses greater than value will be RX only. Value of 0 is not valid (system will have no stack). If set to 0, the system acts as if the entire SRAM is RWX.  Any non-zero value can be configured, including a value = SRAM size.</description>
                            <bitOffset>0x5</bitOffset>
                            <bitWidth>0xF</bitWidth>
                            <access>read-write</access>
                            </field>
                    </fields>
                </register>
                <register>
                    <name>SYSCTL_SYSTEMCFG</name>
                    <description>System configuration</description>
                    <addressOffset>0x1180</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000006</resetValue>
                    <resetMask>0xff000007</resetMask>
                    <fields>
                        <field>
                            <name>FLASHECCRSTDIS</name>
                            <description>FLASHECCRSTDIS specifies whether a flash ECC double error detect (DED) will trigger a SYSRST or an NMI.</description>
                            <bitOffset>0x2</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>read-write</access>
                            <enumeratedValues>
                                    <enumeratedValue>
                                        <name>FALSE</name>
                                        <description>Flash ECC DED will trigger a SYSRST</description>
                                        <value>0x0</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>TRUE</name>
                                        <description>Flash ECC DED will trigger a NMI</description>
                                        <value>0x1</value>
                                    </enumeratedValue>
                                </enumeratedValues>
                            </field>
                        <field>
                            <name>WWDTLP0RSTDIS</name>
                            <description>WWDTLP0RSTDIS specifies whether a WWDT Error Event will trigger a BOOTRST or an NMI.</description>
                            <bitOffset>0x0</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>read-write</access>
                            <enumeratedValues>
                                    <enumeratedValue>
                                        <name>FALSE</name>
                                        <description>WWDTLP0 Error Event will trigger a BOOTRST</description>
                                        <value>0x0</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>TRUE</name>
                                        <description>WWDTLP0 Error Event will trigger an NMI</description>
                                        <value>0x1</value>
                                    </enumeratedValue>
                                </enumeratedValues>
                            </field>
                        <field>
                            <name>WWDTLP1RSTDIS</name>
                            <description>WWDTLP1RSTDIS specifies whether a WWDT Error Event will trigger a SYSRST or an NMI.</description>
                            <bitOffset>0x1</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>read-write</access>
                            <enumeratedValues>
                                    <enumeratedValue>
                                        <name>FALSE</name>
                                        <description>WWDTLP1 Error Event will trigger a SYSRST</description>
                                        <value>0x0</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>TRUE</name>
                                        <description>WWDTLP1 Error Event will trigger an NMI</description>
                                        <value>0x1</value>
                                    </enumeratedValue>
                                </enumeratedValues>
                            </field>
                    </fields>
                </register>
                <register>
                    <name>SYSCTL_WRITELOCK</name>
                    <description>SYSCTL register write lockout</description>
                    <addressOffset>0x1200</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0x00000001</resetMask>
                    <fields>
                        <field>
                            <name>ACTIVE</name>
                            <description>ACTIVE controls whether critical SYSCTL registers are write protected or not.</description>
                            <bitOffset>0x0</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>read-write</access>
                            <enumeratedValues>
                                    <enumeratedValue>
                                        <name>DISABLE</name>
                                        <description>Allow writes to lockable registers</description>
                                        <value>0x0</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>ENABLE</name>
                                        <description>Disallow writes to lockable registers</description>
                                        <value>0x1</value>
                                    </enumeratedValue>
                                </enumeratedValues>
                            </field>
                    </fields>
                </register>
