mspm0-rs/mspm0-data-sources/svd/MSPM0G511X.svd
                <register>
                    <name>SYSCTL_EXRSTPIN</name>
                    <description>Disable the reset function of the NRST pin</description>
                    <addressOffset>0x1320</addressOffset>
                    <size>32</size>
                    <access>write-only</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xff000001</resetMask>
                    <fields>
                        <field>
                            <name>DISABLE</name>
                            <description>Set DISABLE to disable the reset function of the NRST pin.  Once set, this configuration is locked until the next POR.</description>
                            <bitOffset>0x0</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>write-only</access>
                            <enumeratedValues>
                                    <enumeratedValue>
                                        <name>FALSE</name>
                                        <description>Reset function of NRST pin is enabled</description>
                                        <value>0x0</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>TRUE</name>
                                        <description>Reset function of NRST pin is disabled</description>
                                        <value>0x1</value>
                                    </enumeratedValue>
                                </enumeratedValues>
                            </field>
                    </fields>
                </register>
                <register>
                    <name>SYSCTL_SYSSTATUSCLR</name>
                    <description>Clear sticky bits of SYSSTATUS</description>
                    <addressOffset>0x1324</addressOffset>
                    <size>32</size>
                    <access>write-only</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xff000001</resetMask>
                    <fields>
                        <field>
                            <name>ALLECC</name>
                            <description>Set ALLECC to clear all ECC related SYSSTATUS indicators.</description>
                            <bitOffset>0x0</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>write-only</access>
                            <enumeratedValues>
                                    <enumeratedValue>
                                        <name>CLEAR</name>
                                        <description>Clear ECC error state</description>
                                        <value>0x1</value>
                                    </enumeratedValue>
                                </enumeratedValues>
                            </field>
                    </fields>
                </register>
                <register>
                    <name>SYSCTL_SWDCFG</name>
                    <description>Disable the SWD function on the SWD pins</description>
                    <addressOffset>0x1328</addressOffset>
                    <size>32</size>
                    <access>write-only</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xff000001</resetMask>
                    <fields>
                        <field>
                            <name>DISABLE</name>
                            <description>Set DISABLE to disable the SWD function on SWD pins, allowing the SWD pins to be used as GPIO.</description>
                            <bitOffset>0x0</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>write-only</access>
                            <enumeratedValues>
                                    <enumeratedValue>
                                        <name>TRUE</name>
                                        <description>Disable SWD function on SWD pins</description>
                                        <value>0x1</value>
                                    </enumeratedValue>
                                </enumeratedValues>
                            </field>
                    </fields>
                </register>
                <register>
                    <name>SYSCTL_FCCCMD</name>
                    <description>Frequency clock counter start capture</description>
                    <addressOffset>0x132C</addressOffset>
                    <size>32</size>
                    <access>write-only</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xff000001</resetMask>
                    <fields>
                        <field>
                            <name>GO</name>
                            <description>Set GO to start a capture with the frequency clock counter (FCC).</description>
                            <bitOffset>0x0</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>write-only</access>
                            <enumeratedValues>
                                    <enumeratedValue>
                                        <name>TRUE</name>
                                        <description></description>
                                        <value>0x1</value>
                                    </enumeratedValue>
                                </enumeratedValues>
                            </field>
                    </fields>
                </register>
                <register>
                    <name>SYSCTL_USBFLLCTL</name>
                    <description>USB FLL Control Register</description>
                    <addressOffset>0x1340</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0x00000103</resetMask>
                    <fields>
                        <field>
                            <name>FLLEN</name>
                            <description>USB Oscillator Frequeny Lock Loop Enable</description>
                            <bitOffset>0x1</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>read-write</access>
                            <enumeratedValues>
                                    <enumeratedValue>
                                        <name>FALSE</name>
                                        <description>USB CLK Frequeny Lock Loop is disabled</description>
                                        <value>0x0</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>TRUE</name>
                                        <description>USB CLK Frequeny Lock Loop is enabled</description>
                                        <value>0x1</value>
                                    </enumeratedValue>
                                </enumeratedValues>
                            </field>
                        <field>
                            <name>REFSEL</name>
                            <description>Reference Clock Selection for Frequency Lock Loop</description>
                            <bitOffset>0x8</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>read-write</access>
                            <enumeratedValues>
                                    <enumeratedValue>
                                        <name>USBSOF</name>
                                        <description>Use USB Start-Of-Frame as Reference Clock</description>
                                        <value>0x0</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>LFCLK</name>
                                        <description>Use LFCLK as Reference Clock</description>
                                        <value>0x1</value>
                                    </enumeratedValue>
                                </enumeratedValues>
                            </field>
                        <field>
                            <name>CLKEN</name>
                            <description>USB Oscillator Enable</description>
                            <bitOffset>0x0</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>read-write</access>
                            <enumeratedValues>
                                    <enumeratedValue>
                                        <name>FALSE</name>
                                        <description>USB CLK is disabled</description>
                                        <value>0x0</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>TRUE</name>
                                        <description>USB CLK is enabled</description>
                                        <value>0x1</value>
                                    </enumeratedValue>
                                </enumeratedValues>
                            </field>
                    </fields>
                </register>
                <register>
                    <name>SYSCTL_USBFLLADJ</name>
                    <description>USB FLL Manual Adjustment Register</description>
                    <addressOffset>0x1344</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0x0000073f</resetMask>
                    <fields>
                        <field>
                            <name>FRQMOD</name>
                            <description>Frequency Lock Loop Modulator Value</description>
                            <bitOffset>0x8</bitOffset>
                            <bitWidth>0x3</bitWidth>
                            <access>read-write</access>
                            </field>
                        <field>
                            <name>FRQADJ</name>
                            <description>Frequency Lock Loop Adjust</description>
                            <bitOffset>0x0</bitOffset>
                            <bitWidth>0x6</bitWidth>
                            <access>read-write</access>
                            </field>
                    </fields>
                </register>
                <register>
                    <name>SYSCTL_USBFLLSTAT</name>
                    <description>USB FLL Status Register</description>
                    <addressOffset>0x1348</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0x073f0103</resetMask>
                    <fields>
                        <field>
                            <name>FRQMOD</name>
                            <description>Current Frequency Lock Loop Modulator Value</description>
                            <bitOffset>0x18</bitOffset>
                            <bitWidth>0x3</bitWidth>
                            <access>read-only</access>
                            </field>
                        <field>
                            <name>REFRDY</name>
                            <description>Reference Clock for Frequency Lock Loop ready indication</description>
                            <bitOffset>0x8</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>read-only</access>
                            <enumeratedValues>
                                    <enumeratedValue>
                                        <name>FALSE</name>
                                        <description>USB FLL Reference clock is not ready</description>
                                        <value>0x0</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>TRUE</name>
                                        <description>USB FLL Reference clock is ready</description>
                                        <value>0x1</value>
                                    </enumeratedValue>
                                </enumeratedValues>
                            </field>
                        <field>
                            <name>FLLLOCK</name>
                            <description>USB Oscillator Frequeny Lock Loop Lock Indication</description>
                            <bitOffset>0x1</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>read-only</access>
                            <enumeratedValues>
                                    <enumeratedValue>
                                        <name>FALSE</name>
                                        <description>USB CLK Frequeny Lock Loop is not locked</description>
                                        <value>0x0</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>TRUE</name>
                                        <description>USB CLK Frequeny Lock Loop is locked</description>
                                        <value>0x1</value>
                                    </enumeratedValue>
                                </enumeratedValues>
                            </field>
                        <field>
                            <name>CLKRDY</name>
                            <description>USB Oscillator Ready Indication</description>
                            <bitOffset>0x0</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>read-only</access>
                            <enumeratedValues>
                                    <enumeratedValue>
                                        <name>FALSE</name>
                                        <description>USB CLK is not ready</description>
                                        <value>0x0</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>TRUE</name>
                                        <description>USB CLK is ready</description>
                                        <value>0x1</value>
                                    </enumeratedValue>
                                </enumeratedValues>
                            </field>
                        <field>
                            <name>FRQADJ</name>
                            <description>Current Frequency Lock Loop Adjust</description>
                            <bitOffset>0x10</bitOffset>
                            <bitWidth>0x6</bitWidth>
                            <access>read-only</access>
                            </field>
                    </fields>
                </register>
                <register>
                    <name>SYSCTL_SHUTDNSTORE0</name>
                    <description>Shutdown storage memory (byte 0)</description>
                    <addressOffset>0x1400</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0x000003ff</resetMask>
                    <fields>
                        <field>
                            <name>DATA</name>
                            <description>Shutdown storage byte 0</description>
                            <bitOffset>0x0</bitOffset>
                            <bitWidth>0x8</bitWidth>
                            <access>read-write</access>
                            </field>
                    </fields>
                </register>
                <register>
                    <name>SYSCTL_SHUTDNSTORE1</name>
                    <description>Shutdown storage memory (byte 1)</description>
                    <addressOffset>0x1404</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0x000003ff</resetMask>
                    <fields>
                        <field>
                            <name>DATA</name>
                            <description>Shutdown storage byte 1</description>
                            <bitOffset>0x0</bitOffset>
                            <bitWidth>0x8</bitWidth>
                            <access>read-write</access>
                            </field>
                    </fields>
                </register>
                <register>
                    <name>SYSCTL_SHUTDNSTORE2</name>
                    <description>Shutdown storage memory (byte 2)</description>
                    <addressOffset>0x1408</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0x000003ff</resetMask>
                    <fields>
                        <field>
                            <name>DATA</name>
                            <description>Shutdown storage byte 2</description>
                            <bitOffset>0x0</bitOffset>
                            <bitWidth>0x8</bitWidth>
                            <access>read-write</access>
                            </field>
                    </fields>
                </register>
                <register>
                    <name>SYSCTL_SHUTDNSTORE3</name>
                    <description>Shutdown storage memory (byte 3)</description>
                    <addressOffset>0x140C</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0x000003ff</resetMask>
                    <fields>
                        <field>
                            <name>DATA</name>
                            <description>Shutdown storage byte 3</description>
                            <bitOffset>0x0</bitOffset>
                            <bitWidth>0x8</bitWidth>
                            <access>read-write</access>
                            </field>
                    </fields>
                </register>
                <register>
                    <name>SYSCTL_FWEPROTMAIN</name>
                    <description>1 Sector Write-Erase per bit starting at address 0x0 of flash</description>
                    <addressOffset>0x3000</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xffffffff</resetMask>
                    <fields>
                    </fields>
                </register>
                <register>
                    <name>SYSCTL_FWPROTMAINDATA</name>
                    <description>Read-Write Protection for first 4 Sectors of Data Bank</description>
                    <addressOffset>0x3014</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0x000000ff</resetMask>
                    <fields>
                        <field>
                            <name>DATA</name>
                            <description>00: Both RW allowed 01: Read Only 10: No Read  No Write 11: No Read No Write - Not Used</description>
                            <bitOffset>0x0</bitOffset>
                            <bitWidth>0x8</bitWidth>
                            <access>read-write</access>
                            </field>
                    </fields>
                </register>
                <register>
                    <name>SYSCTL_FRXPROTMAINSTART</name>
                    <description>Flash RX Protection Start Address</description>
                    <addressOffset>0x3018</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0x003fffc0</resetMask>
                    <fields>
                        <field>
                            <name>ADDR</name>
                            <description>Flash RX Protection Start Address 64B granularity</description>
                            <bitOffset>0x6</bitOffset>
                            <bitWidth>0x10</bitWidth>
                            <access>read-write</access>
                            </field>
                    </fields>
                </register>
                <register>
                    <name>SYSCTL_FRXPROTMAINEND</name>
                    <description>Flash RX Protection End Address</description>
                    <addressOffset>0x301C</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0x003fffc0</resetMask>
                    <fields>
                        <field>
                            <name>ADDR</name>
                            <description>Flash RX Protection End Address 64B granularity</description>
                            <bitOffset>0x6</bitOffset>
                            <bitWidth>0x10</bitWidth>
                            <access>read-write</access>
                            </field>
                    </fields>
                </register>
                <register>
                    <name>SYSCTL_FIPPROTMAINSTART</name>
                    <description>Flash IP Protection Start Address</description>
                    <addressOffset>0x3020</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0x003fffc0</resetMask>
                    <fields>
                        <field>
                            <name>ADDR</name>
                            <description>Flash IP Protection Start Address 64B granularity</description>
                            <bitOffset>0x6</bitOffset>
                            <bitWidth>0x10</bitWidth>
                            <access>read-write</access>
                            </field>
                    </fields>
                </register>
                <register>
                    <name>SYSCTL_FIPPROTMAINEND</name>
                    <description>Flash IP Protection End Address</description>
                    <addressOffset>0x3024</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0x003fffc0</resetMask>
                    <fields>
                        <field>
                            <name>ADDR</name>
                            <description>Flash IP Protection End Address 64B granularity</description>
                            <bitOffset>0x6</bitOffset>
                            <bitWidth>0x10</bitWidth>
                            <access>read-write</access>
                            </field>
                    </fields>
                </register>
