mspm0-rs/mspm0-data-sources/svd/MSPM0G511X.svd
                <register>
                    <name>FLASHCTL_CMDTYPE</name>
                    <description>Command Type Register</description>
                    <addressOffset>0x1104</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <fields>
                        <field>
                            <name>COMMAND</name>
                            <description>Command type</description>
                            <bitOffset>0x0</bitOffset>
                            <bitWidth>0x3</bitWidth>
                            <access>read-write</access>
                            <enumeratedValues>
                                    <enumeratedValue>
                                        <name>NOOP</name>
                                        <description>No Operation</description>
                                        <value>0x0</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>PROGRAM</name>
                                        <description>Program</description>
                                        <value>0x1</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>ERASE</name>
                                        <description>Erase</description>
                                        <value>0x2</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>READVERIFY</name>
                                        <description>ReadVerify - Perform a standalone ReadVerify operation.</description>
                                        <value>0x3</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>MODECHANGE</name>
                                        <description>Mode Change - Perform a mode change only, no other operation.</description>
                                        <value>0x4</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>CLEARSTATUS</name>
                                        <description>Clear Status - Clear status bits in FW_SMSTAT only.</description>
                                        <value>0x5</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>BLANKVERIFY</name>
                                        <description>Blank Verify - Check whether a flash word is in the erased state.
This command may only be used with CMDTYPE.SIZE = ONEWORD</description>
                                        <value>0x6</value>
                                    </enumeratedValue>
                                </enumeratedValues>
                            </field>
                        <field>
                            <name>SIZE</name>
                            <description>Command size</description>
                            <bitOffset>0x4</bitOffset>
                            <bitWidth>0x3</bitWidth>
                            <access>read-write</access>
                            <enumeratedValues>
                                    <enumeratedValue>
                                        <name>ONEWORD</name>
                                        <description>Operate on 1 flash word</description>
                                        <value>0x0</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>TWOWORD</name>
                                        <description>Operate on 2 flash words</description>
                                        <value>0x1</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>FOURWORD</name>
                                        <description>Operate on 4 flash words</description>
                                        <value>0x2</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>EIGHTWORD</name>
                                        <description>Operate on 8 flash words</description>
                                        <value>0x3</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>SECTOR</name>
                                        <description>Operate on a flash sector</description>
                                        <value>0x4</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>BANK</name>
                                        <description>Operate on an entire flash bank</description>
                                        <value>0x5</value>
                                    </enumeratedValue>
                                </enumeratedValues>
                            </field>
                    </fields>
                </register>
                <register>
                    <name>FLASHCTL_CMDCTL</name>
                    <description>Command Control Register</description>
                    <addressOffset>0x1108</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <fields>
                        <field>
                            <name>MODESEL</name>
                            <description>Mode
This field is only used for the Mode Change command type.  Otherwise, bank
and pump modes are set automaticlly through the NW hardware.</description>
                            <bitOffset>0x0</bitOffset>
                            <bitWidth>0x4</bitWidth>
                            <access>read-write</access>
                            <enumeratedValues>
                                    <enumeratedValue>
                                        <name>READ</name>
                                        <description>Read Mode</description>
                                        <value>0x0</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>RDMARG0</name>
                                        <description>Read Margin 0 Mode</description>
                                        <value>0x2</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>RDMARG1</name>
                                        <description>Read Margin 1 Mode</description>
                                        <value>0x4</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>RDMARG0B</name>
                                        <description>Read Margin 0B Mode</description>
                                        <value>0x6</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>RDMARG1B</name>
                                        <description>Read Margin 1B Mode</description>
                                        <value>0x7</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>PGMVER</name>
                                        <description>Program Verify Mode</description>
                                        <value>0x9</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>PGMSW</name>
                                        <description>Program Single Word</description>
                                        <value>0xA</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>ERASEVER</name>
                                        <description>Erase Verify Mode</description>
                                        <value>0xB</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>ERASESECT</name>
                                        <description>Erase Sector</description>
                                        <value>0xC</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>PGMMW</name>
                                        <description>Program Multiple Word</description>
                                        <value>0xE</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>ERASEBNK</name>
                                        <description>Erase Bank</description>
                                        <value>0xF</value>
                                    </enumeratedValue>
                                </enumeratedValues>
                            </field>
                        <field>
                            <name>BANKSEL</name>
                            <description>Bank Select
A specific Bank ID can be written to this field to indicate to which bank an 
operation is to be applied if CMDCTL.ADDRXLATEOVR is set.</description>
                            <bitOffset>0x4</bitOffset>
                            <bitWidth>0x5</bitWidth>
                            <access>read-write</access>
                            <enumeratedValues>
                                    <enumeratedValue>
                                        <name>BANK0</name>
                                        <description>Bank 0</description>
                                        <value>0x1</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>BANK1</name>
                                        <description>Bank 1</description>
                                        <value>0x2</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>BANK2</name>
                                        <description>Bank 2</description>
                                        <value>0x4</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>BANK3</name>
                                        <description>Bank 3</description>
                                        <value>0x8</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>BANK4</name>
                                        <description>Bank 4</description>
                                        <value>0x10</value>
                                    </enumeratedValue>
                                </enumeratedValues>
                            </field>
                        <field>
                            <name>REGIONSEL</name>
                            <description>Bank Region
A specific region ID can be written to this field to indicate to which region an 
operation is to be applied if CMDCTL.ADDRXLATEOVR is set.</description>
                            <bitOffset>0x9</bitOffset>
                            <bitWidth>0x4</bitWidth>
                            <access>read-write</access>
                            <enumeratedValues>
                                    <enumeratedValue>
                                        <name>MAIN</name>
                                        <description>Main Region</description>
                                        <value>0x1</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>NONMAIN</name>
                                        <description>Non-Main Region</description>
                                        <value>0x2</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>TRIM</name>
                                        <description>Trim Region</description>
                                        <value>0x4</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>ENGR</name>
                                        <description>Engr Region</description>
                                        <value>0x8</value>
                                    </enumeratedValue>
                                </enumeratedValues>
                            </field>
                        <field>
                            <name>ECCGENOVR</name>
                            <description>Override hardware generation of ECC data for program.  Use data written to 
CMDDATAECC*.</description>
                            <bitOffset>0x11</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>read-write</access>
                            <enumeratedValues>
                                    <enumeratedValue>
                                        <name>NOOVERRIDE</name>
                                        <description>Do not override</description>
                                        <value>0x0</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>OVERRIDE</name>
                                        <description>Override</description>
                                        <value>0x1</value>
                                    </enumeratedValue>
                                </enumeratedValues>
                            </field>
                        <field>
                            <name>ADDRXLATEOVR</name>
                            <description>Override hardware address translation of address in CMDADDR from a 
system address to a bank address and bank ID.  Use data written to 
CMDADDR directly as the bank address.  Use the value written to 
CMDCTL.BANKSEL directly as the bank ID.  Use the value written to
CMDCTL.REGIONSEL directly as the region ID.</description>
                            <bitOffset>0x10</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>read-write</access>
                            <enumeratedValues>
                                    <enumeratedValue>
                                        <name>NOOVERRIDE</name>
                                        <description>Do not override</description>
                                        <value>0x0</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>OVERRIDE</name>
                                        <description>Override</description>
                                        <value>0x1</value>
                                    </enumeratedValue>
                                </enumeratedValues>
                            </field>
                        <field>
                            <name>SSERASEDIS</name>
                            <description>Disable Stair-Step Erase.  If set, the default VHV trim voltage setting will be used
for all erase pulses.
By default, this bit is reset, meaning that the VHV voltage will be stepped during
successive erase pulses.  The step count, step voltage, begin and end voltages
are all hard-wired.</description>
                            <bitOffset>0x14</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>read-write</access>
                            <enumeratedValues>
                                    <enumeratedValue>
                                        <name>ENABLE</name>
                                        <description>Enable</description>
                                        <value>0x0</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>DISABLE</name>
                                        <description>Disable</description>
                                        <value>0x1</value>
                                    </enumeratedValue>
                                </enumeratedValues>
                            </field>
                        <field>
                            <name>DATAVEREN</name>
                            <description>Enable invalid data verify.  
This checks for 0-&gt;1 transitions in the memory when
a program operation is initiated.  If such a transition is found, the program will
fail with an error without executing the program.</description>
                            <bitOffset>0x15</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>read-write</access>
                            <enumeratedValues>
                                    <enumeratedValue>
                                        <name>DISABLE</name>
                                        <description>Disable</description>
                                        <value>0x0</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>ENABLE</name>
                                        <description>Enable</description>
                                        <value>0x1</value>
                                    </enumeratedValue>
                                </enumeratedValues>
                            </field>
                    </fields>
                </register>
                <register>
                    <name>FLASHCTL_CMDADDR</name>
                    <description>Command Address Register</description>
                    <addressOffset>0x1120</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <fields>
                        <field>
                            <name>VAL</name>
                            <description>Address value</description>
                            <bitOffset>0x0</bitOffset>
                            <bitWidth>0x20</bitWidth>
                            <access>read-write</access>
                            </field>
                    </fields>
                </register>
                <register>
                    <name>FLASHCTL_CMDBYTEN</name>
                    <description>Command Program Byte Enable Register</description>
                    <addressOffset>0x1124</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <fields>
                        <field>
                            <name>VAL</name>
                            <description>Command Byte Enable value.
A 1-bit per flash word byte value is placed in this register.</description>
                            <bitOffset>0x0</bitOffset>
                            <bitWidth>0x12</bitWidth>
                            <access>read-write</access>
                            </field>
                    </fields>
                </register>
                <register>
                    <name>FLASHCTL_CMDDATAINDEX</name>
                    <description>Command Data Index Register</description>
                    <addressOffset>0x112C</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <fields>
                        <field>
                            <name>VAL</name>
                            <description>Data register index</description>
                            <bitOffset>0x0</bitOffset>
                            <bitWidth>0x3</bitWidth>
                            <access>read-write</access>
                            </field>
                    </fields>
                </register>
                <register>
                    <name>FLASHCTL_CMDDATA0</name>
                    <description>Command Data Register 0</description>
                    <addressOffset>0x1130</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <fields>
                        <field>
                            <name>VAL</name>
                            <description>A 32-bit data value is placed in this field.</description>
                            <bitOffset>0x0</bitOffset>
                            <bitWidth>0x20</bitWidth>
                            <access>read-write</access>
                            </field>
                    </fields>
                </register>
                <register>
                    <name>FLASHCTL_CMDDATA1</name>
                    <description>Command Data Register 1</description>
                    <addressOffset>0x1134</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <fields>
                        <field>
                            <name>VAL</name>
                            <description>A 32-bit data value is placed in this field.</description>
                            <bitOffset>0x0</bitOffset>
                            <bitWidth>0x20</bitWidth>
                            <access>read-write</access>
                            </field>
                    </fields>
                </register>
                <register>
                    <name>FLASHCTL_CMDDATA2</name>
                    <description>Command Data Register 2</description>
                    <addressOffset>0x1138</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <fields>
                        <field>
                            <name>VAL</name>
                            <description>A 32-bit data value is placed in this field.</description>
                            <bitOffset>0x0</bitOffset>
                            <bitWidth>0x20</bitWidth>
                            <access>read-write</access>
                            </field>
                    </fields>
                </register>
