mspm0-rs/mspm0-data-sources/svd/MSPM0G511X.svd
                    <register>
                        <name>EVENTLP_DIAGPAR23</name>
                        <description>Diagnostic Parity Register 23</description>
                        <addressOffset>0x390</addressOffset>
                        <size>32</size>
                        <access>write-only</access>
                        <resetValue>0x00000000</resetValue>
                        <resetMask>0xffffffff</resetMask>
                        <fields>
                            <field>
                                <name>ASSERTDIAG</name>
                                <description>Writing a 1 will cause the safety diagnostic logic to generate a diagnostic check.</description>
                                <bitOffset>0x0</bitOffset>
                                <bitWidth>0x1</bitWidth>
                                <enumeratedValues>
                                        <enumeratedValue>
                                            <name>NO_EFFECT</name>
                                            <description>No Effect</description>
                                            <value>0x0</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>START</name>
                                            <description>Generate diagnostic check</description>
                                            <value>0x1</value>
                                        </enumeratedValue>
                                    </enumeratedValues>
                                </field>
                        </fields>
                    </register>
                    <register>
                        <name>EVENTLP_DIAGPAR22</name>
                        <description>Diagnostic Parity Register 22</description>
                        <addressOffset>0x394</addressOffset>
                        <size>32</size>
                        <access>write-only</access>
                        <resetValue>0x00000000</resetValue>
                        <resetMask>0xffffffff</resetMask>
                        <fields>
                            <field>
                                <name>ASSERTDIAG</name>
                                <description>Writing a 1 will cause the safety diagnostic logic to generate a diagnostic check.</description>
                                <bitOffset>0x0</bitOffset>
                                <bitWidth>0x1</bitWidth>
                                <enumeratedValues>
                                        <enumeratedValue>
                                            <name>NO_EFFECT</name>
                                            <description>No Effect</description>
                                            <value>0x0</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>START</name>
                                            <description>Generate diagnostic check</description>
                                            <value>0x1</value>
                                        </enumeratedValue>
                                    </enumeratedValues>
                                </field>
                        </fields>
                    </register>
                    <register>
                        <name>EVENTLP_DIAGPAR21</name>
                        <description>Diagnostic Parity Register 21</description>
                        <addressOffset>0x398</addressOffset>
                        <size>32</size>
                        <access>write-only</access>
                        <resetValue>0x00000000</resetValue>
                        <resetMask>0xffffffff</resetMask>
                        <fields>
                            <field>
                                <name>ASSERTDIAG</name>
                                <description>Writing a 1 will cause the safety diagnostic logic to generate a diagnostic check.</description>
                                <bitOffset>0x0</bitOffset>
                                <bitWidth>0x1</bitWidth>
                                <enumeratedValues>
                                        <enumeratedValue>
                                            <name>NO_EFFECT</name>
                                            <description>No Effect</description>
                                            <value>0x0</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>START</name>
                                            <description>Generate diagnostic check</description>
                                            <value>0x1</value>
                                        </enumeratedValue>
                                    </enumeratedValues>
                                </field>
                        </fields>
                    </register>
                    <register>
                        <name>EVENTLP_DIAGPAR20</name>
                        <description>Diagnostic Parity Register 20</description>
                        <addressOffset>0x39C</addressOffset>
                        <size>32</size>
                        <access>write-only</access>
                        <resetValue>0x00000000</resetValue>
                        <resetMask>0xffffffff</resetMask>
                        <fields>
                            <field>
                                <name>ASSERTDIAG</name>
                                <description>Writing a 1 will cause the safety diagnostic logic to generate a diagnostic check.</description>
                                <bitOffset>0x0</bitOffset>
                                <bitWidth>0x1</bitWidth>
                                <enumeratedValues>
                                        <enumeratedValue>
                                            <name>NO_EFFECT</name>
                                            <description>No Effect</description>
                                            <value>0x0</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>START</name>
                                            <description>Generate diagnostic check</description>
                                            <value>0x1</value>
                                        </enumeratedValue>
                                    </enumeratedValues>
                                </field>
                        </fields>
                    </register>
                    <register>
                        <name>EVENTLP_DIAGPAR19</name>
                        <description>Diagnostic Parity Register 19</description>
                        <addressOffset>0x3A0</addressOffset>
                        <size>32</size>
                        <access>write-only</access>
                        <resetValue>0x00000000</resetValue>
                        <resetMask>0xffffffff</resetMask>
                        <fields>
                            <field>
                                <name>ASSERTDIAG</name>
                                <description>Writing a 1 will cause the safety diagnostic logic to generate a diagnostic check.</description>
                                <bitOffset>0x0</bitOffset>
                                <bitWidth>0x1</bitWidth>
                                <enumeratedValues>
                                        <enumeratedValue>
                                            <name>NO_EFFECT</name>
                                            <description>No Effect</description>
                                            <value>0x0</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>START</name>
                                            <description>Generate diagnostic check</description>
                                            <value>0x1</value>
                                        </enumeratedValue>
                                    </enumeratedValues>
                                </field>
                        </fields>
                    </register>
                    <register>
                        <name>EVENTLP_DIAGPAR18</name>
                        <description>Diagnostic Parity Register 18</description>
                        <addressOffset>0x3A4</addressOffset>
                        <size>32</size>
                        <access>write-only</access>
                        <resetValue>0x00000000</resetValue>
                        <resetMask>0xffffffff</resetMask>
                        <fields>
                            <field>
                                <name>ASSERTDIAG</name>
                                <description>Writing a 1 will cause the safety diagnostic logic to generate a diagnostic check.</description>
                                <bitOffset>0x0</bitOffset>
                                <bitWidth>0x1</bitWidth>
                                <enumeratedValues>
                                        <enumeratedValue>
                                            <name>NO_EFFECT</name>
                                            <description>No Effect</description>
                                            <value>0x0</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>START</name>
                                            <description>Generate diagnostic check</description>
                                            <value>0x1</value>
                                        </enumeratedValue>
                                    </enumeratedValues>
                                </field>
                        </fields>
                    </register>
                    <register>
                        <name>EVENTLP_DIAGPAR17</name>
                        <description>Diagnostic Parity Register 17</description>
                        <addressOffset>0x3A8</addressOffset>
                        <size>32</size>
                        <access>write-only</access>
                        <resetValue>0x00000000</resetValue>
                        <resetMask>0xffffffff</resetMask>
                        <fields>
                            <field>
                                <name>ASSERTDIAG</name>
                                <description>Writing a 1 will cause the safety diagnostic logic to generate a diagnostic check.</description>
                                <bitOffset>0x0</bitOffset>
                                <bitWidth>0x1</bitWidth>
                                <enumeratedValues>
                                        <enumeratedValue>
                                            <name>NO_EFFECT</name>
                                            <description>No Effect</description>
                                            <value>0x0</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>START</name>
                                            <description>Generate diagnostic check</description>
                                            <value>0x1</value>
                                        </enumeratedValue>
                                    </enumeratedValues>
                                </field>
                        </fields>
                    </register>
                    <register>
                        <name>EVENTLP_DIAGPAR16</name>
                        <description>Diagnostic Parity Register 16</description>
                        <addressOffset>0x3AC</addressOffset>
                        <size>32</size>
                        <access>write-only</access>
                        <resetValue>0x00000000</resetValue>
                        <resetMask>0xffffffff</resetMask>
                        <fields>
                            <field>
                                <name>ASSERTDIAG</name>
                                <description>Writing a 1 will cause the safety diagnostic logic to generate a diagnostic check.</description>
                                <bitOffset>0x0</bitOffset>
                                <bitWidth>0x1</bitWidth>
                                <enumeratedValues>
                                        <enumeratedValue>
                                            <name>NO_EFFECT</name>
                                            <description>No Effect</description>
                                            <value>0x0</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>START</name>
                                            <description>Generate diagnostic check</description>
                                            <value>0x1</value>
                                        </enumeratedValue>
                                    </enumeratedValues>
                                </field>
                        </fields>
                    </register>
                    <register>
                        <name>EVENTLP_DIAGPAR15</name>
                        <description>Diagnostic Parity Register 15</description>
                        <addressOffset>0x3B0</addressOffset>
                        <size>32</size>
                        <access>write-only</access>
                        <resetValue>0x00000000</resetValue>
                        <resetMask>0xffffffff</resetMask>
                        <fields>
                            <field>
                                <name>ASSERTDIAG</name>
                                <description>Writing a 1 will cause the safety diagnostic logic to generate a diagnostic check.</description>
                                <bitOffset>0x0</bitOffset>
                                <bitWidth>0x1</bitWidth>
                                <enumeratedValues>
                                        <enumeratedValue>
                                            <name>NO_EFFECT</name>
                                            <description>No Effect</description>
                                            <value>0x0</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>START</name>
                                            <description>Generate diagnostic check</description>
                                            <value>0x1</value>
                                        </enumeratedValue>
                                    </enumeratedValues>
                                </field>
                        </fields>
                    </register>
                    <register>
                        <name>EVENTLP_DIAGPAR14</name>
                        <description>Diagnostic Parity Register 14</description>
                        <addressOffset>0x3B4</addressOffset>
                        <size>32</size>
                        <access>write-only</access>
                        <resetValue>0x00000000</resetValue>
                        <resetMask>0xffffffff</resetMask>
                        <fields>
                            <field>
                                <name>ASSERTDIAG</name>
                                <description>Writing a 1 will cause the safety diagnostic logic to generate a diagnostic check.</description>
                                <bitOffset>0x0</bitOffset>
                                <bitWidth>0x1</bitWidth>
                                <enumeratedValues>
                                        <enumeratedValue>
                                            <name>NO_EFFECT</name>
                                            <description>No Effect</description>
                                            <value>0x0</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>START</name>
                                            <description>Generate diagnostic check</description>
                                            <value>0x1</value>
                                        </enumeratedValue>
                                    </enumeratedValues>
                                </field>
                        </fields>
                    </register>
                    <register>
                        <name>EVENTLP_DIAGPAR13</name>
                        <description>Diagnostic Parity Register 13</description>
                        <addressOffset>0x3B8</addressOffset>
                        <size>32</size>
                        <access>write-only</access>
                        <resetValue>0x00000000</resetValue>
                        <resetMask>0xffffffff</resetMask>
                        <fields>
                            <field>
                                <name>ASSERTDIAG</name>
                                <description>Writing a 1 will cause the safety diagnostic logic to generate a diagnostic check.</description>
                                <bitOffset>0x0</bitOffset>
                                <bitWidth>0x1</bitWidth>
                                <enumeratedValues>
                                        <enumeratedValue>
                                            <name>NO_EFFECT</name>
                                            <description>No Effect</description>
                                            <value>0x0</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>START</name>
                                            <description>Generate diagnostic check</description>
                                            <value>0x1</value>
                                        </enumeratedValue>
                                    </enumeratedValues>
                                </field>
                        </fields>
                    </register>
                    <register>
                        <name>EVENTLP_DIAGPAR12</name>
                        <description>Diagnostic Parity Register 12</description>
                        <addressOffset>0x3BC</addressOffset>
                        <size>32</size>
                        <access>write-only</access>
                        <resetValue>0x00000000</resetValue>
                        <resetMask>0xffffffff</resetMask>
                        <fields>
                            <field>
                                <name>ASSERTDIAG</name>
                                <description>Writing a 1 will cause the safety diagnostic logic to generate a diagnostic check.</description>
                                <bitOffset>0x0</bitOffset>
                                <bitWidth>0x1</bitWidth>
                                <enumeratedValues>
                                        <enumeratedValue>
                                            <name>NO_EFFECT</name>
                                            <description>No Effect</description>
                                            <value>0x0</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>START</name>
                                            <description>Generate diagnostic check</description>
                                            <value>0x1</value>
                                        </enumeratedValue>
                                    </enumeratedValues>
                                </field>
                        </fields>
                    </register>
                    <register>
                        <name>EVENTLP_DIAGPAR11</name>
                        <description>Diagnostic Parity Register 11</description>
                        <addressOffset>0x3C0</addressOffset>
                        <size>32</size>
                        <access>write-only</access>
                        <resetValue>0x00000000</resetValue>
                        <resetMask>0xffffffff</resetMask>
                        <fields>
                            <field>
                                <name>ASSERTDIAG</name>
                                <description>Writing a 1 will cause the safety diagnostic logic to generate a diagnostic check.</description>
                                <bitOffset>0x0</bitOffset>
                                <bitWidth>0x1</bitWidth>
                                <enumeratedValues>
                                        <enumeratedValue>
                                            <name>NO_EFFECT</name>
                                            <description>No Effect</description>
                                            <value>0x0</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>START</name>
                                            <description>Generate diagnostic check</description>
                                            <value>0x1</value>
                                        </enumeratedValue>
                                    </enumeratedValues>
                                </field>
                        </fields>
                    </register>
                    <register>
                        <name>EVENTLP_DIAGPAR10</name>
                        <description>Diagnostic Parity Register 10</description>
                        <addressOffset>0x3C4</addressOffset>
                        <size>32</size>
                        <access>write-only</access>
                        <resetValue>0x00000000</resetValue>
                        <resetMask>0xffffffff</resetMask>
                        <fields>
                            <field>
                                <name>ASSERTDIAG</name>
                                <description>Writing a 1 will cause the safety diagnostic logic to generate a diagnostic check.</description>
                                <bitOffset>0x0</bitOffset>
                                <bitWidth>0x1</bitWidth>
                                <enumeratedValues>
                                        <enumeratedValue>
                                            <name>NO_EFFECT</name>
                                            <description>No Effect</description>
                                            <value>0x0</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>START</name>
                                            <description>Generate diagnostic check</description>
                                            <value>0x1</value>
                                        </enumeratedValue>
                                    </enumeratedValues>
                                </field>
                        </fields>
                    </register>
