mspm0-rs/mspm0-data-sources/svd/MSPM0G511X.svd
                <register>
                    <name>USBFS0_RXIE</name>
                    <description>USB Receive Interrupt Enable</description>
                    <addressOffset>0x2008</addressOffset>
                    <size>16</size>
                    <access>read-write</access>
                    <resetValue>0x000000fe</resetValue>
                    <resetMask>0x0000ffff</resetMask>
                    <fields>
                        <field>
                            <name>EP1</name>
                            <description>Recieve Endpoint 1 Interrupt Enable</description>
                            <bitOffset>0x1</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>read-write</access>
                            <enumeratedValues>
                                    <enumeratedValue>
                                        <name>NO_INT</name>
                                        <description>No interrupt</description>
                                        <value>0x0</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>INT</name>
                                        <description>The Endpoint 1 transmit interrupt is asserted.</description>
                                        <value>0x1</value>
                                    </enumeratedValue>
                                </enumeratedValues>
                            </field>
                        <field>
                            <name>EP2</name>
                            <description>Recieve Endpoint 2 Interrupt Enable</description>
                            <bitOffset>0x2</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>read-write</access>
                            <enumeratedValues>
                                    <enumeratedValue>
                                        <name>NO_INT</name>
                                        <description>No interrupt</description>
                                        <value>0x0</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>INT</name>
                                        <description>The Endpoint 2 transmit interrupt is asserted.</description>
                                        <value>0x1</value>
                                    </enumeratedValue>
                                </enumeratedValues>
                            </field>
                        <field>
                            <name>EP3</name>
                            <description>Recieve Endpoint 3 Interrupt Enable</description>
                            <bitOffset>0x3</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>read-write</access>
                            <enumeratedValues>
                                    <enumeratedValue>
                                        <name>NO_INT</name>
                                        <description>No interrupt</description>
                                        <value>0x0</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>INT</name>
                                        <description>The Endpoint 3 transmit interrupt is asserted.</description>
                                        <value>0x1</value>
                                    </enumeratedValue>
                                </enumeratedValues>
                            </field>
                        <field>
                            <name>EP4</name>
                            <description>Recieve Endpoint 4 Interrupt Enable</description>
                            <bitOffset>0x4</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>read-write</access>
                            <enumeratedValues>
                                    <enumeratedValue>
                                        <name>NO_INT</name>
                                        <description>No interrupt</description>
                                        <value>0x0</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>INT</name>
                                        <description>The Endpoint 4 transmit interrupt is asserted.</description>
                                        <value>0x1</value>
                                    </enumeratedValue>
                                </enumeratedValues>
                            </field>
                        <field>
                            <name>EP5</name>
                            <description>Recieve Endpoint 5 Interrupt Enable</description>
                            <bitOffset>0x5</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>read-write</access>
                            <enumeratedValues>
                                    <enumeratedValue>
                                        <name>NO_INT</name>
                                        <description>No interrupt</description>
                                        <value>0x0</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>INT</name>
                                        <description>The Endpoint 5 transmit interrupt is asserted.</description>
                                        <value>0x1</value>
                                    </enumeratedValue>
                                </enumeratedValues>
                            </field>
                        <field>
                            <name>EP6</name>
                            <description>Recieve Endpoint 6 Interrupt Enable</description>
                            <bitOffset>0x6</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>read-write</access>
                            <enumeratedValues>
                                    <enumeratedValue>
                                        <name>NO_INT</name>
                                        <description>No interrupt</description>
                                        <value>0x0</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>INT</name>
                                        <description>The Endpoint 6 transmit interrupt is asserted.</description>
                                        <value>0x1</value>
                                    </enumeratedValue>
                                </enumeratedValues>
                            </field>
                        <field>
                            <name>EP7</name>
                            <description>Recieve Endpoint 7 Interrupt Enable</description>
                            <bitOffset>0x7</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>read-write</access>
                            <enumeratedValues>
                                    <enumeratedValue>
                                        <name>NO_INT</name>
                                        <description>No interrupt</description>
                                        <value>0x0</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>INT</name>
                                        <description>The Endpoint 7 transmit interrupt is asserted.</description>
                                        <value>0x1</value>
                                    </enumeratedValue>
                                </enumeratedValues>
                            </field>
                    </fields>
                </register>
                <register>
                    <name>USBFS0_USBIS</name>
                    <description>USB General Interrupt Status</description>
                    <addressOffset>0x200A</addressOffset>
                    <size>8</size>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0x000000ff</resetMask>
                    <fields>
                        <field>
                            <name>SUSPEND</name>
                            <description>Set when Suspend signaling is detected on the bus.
Note: Only valid in Peripheral mode.</description>
                            <bitOffset>0x0</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>read-only</access>
                            <enumeratedValues>
                                    <enumeratedValue>
                                        <name>NO_INT</name>
                                        <description>No interrupt</description>
                                        <value>0x0</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>INT</name>
                                        <description>SUSPEND signaling has been detected on the bus.</description>
                                        <value>0x1</value>
                                    </enumeratedValue>
                                </enumeratedValues>
                            </field>
                        <field>
                            <name>RESUME</name>
                            <description>Set when Resume signaling is detected on the bus while the USB controller is in Suspend mode.</description>
                            <bitOffset>0x1</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>read-only</access>
                            <enumeratedValues>
                                    <enumeratedValue>
                                        <name>NO_INT</name>
                                        <description>No interrupt</description>
                                        <value>0x0</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>INT</name>
                                        <description>RESUME signaling has been detected on the bus.</description>
                                        <value>0x1</value>
                                    </enumeratedValue>
                                </enumeratedValues>
                            </field>
                        <field>
                            <name>RESETBABBLE</name>
                            <description>Device mode - RESET: Set in Peripheral mode when Reset signaling is detected on the bus.
Host mode - BABBLE: Set in Host mode when babble is detected. Note: Only active after first SOF has been sent.</description>
                            <bitOffset>0x2</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>read-only</access>
                            <enumeratedValues>
                                    <enumeratedValue>
                                        <name>NO_INT</name>
                                        <description>No interrupt</description>
                                        <value>0x0</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>INT</name>
                                        <description>RESET / BABBLE signaling has been detected on the bus.</description>
                                        <value>0x1</value>
                                    </enumeratedValue>
                                </enumeratedValues>
                            </field>
                        <field>
                            <name>SOF</name>
                            <description>Start of frame</description>
                            <bitOffset>0x3</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>read-only</access>
                            <enumeratedValues>
                                    <enumeratedValue>
                                        <name>NO_INT</name>
                                        <description>No interrupt</description>
                                        <value>0x0</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>INT</name>
                                        <description>A new frame has started.</description>
                                        <value>0x1</value>
                                    </enumeratedValue>
                                </enumeratedValues>
                            </field>
                        <field>
                            <name>CONN</name>
                            <description>Set when a device connection is detected. 
Note: Only valid in Host mode. Valid at all transaction speeds.</description>
                            <bitOffset>0x4</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>read-only</access>
                            <enumeratedValues>
                                    <enumeratedValue>
                                        <name>NO_INT</name>
                                        <description>No interrupt</description>
                                        <value>0x0</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>INT</name>
                                        <description>The device has detected a connection to the host.</description>
                                        <value>0x1</value>
                                    </enumeratedValue>
                                </enumeratedValues>
                            </field>
                        <field>
                            <name>DISCON</name>
                            <description>Set in Host mode when a device disconnect is detected.
Set in Peripheral mode when a session ends. Valid at all transaction speeds.</description>
                            <bitOffset>0x5</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>read-only</access>
                            <enumeratedValues>
                                    <enumeratedValue>
                                        <name>NO_INT</name>
                                        <description>No interrupt</description>
                                        <value>0x0</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>INT</name>
                                        <description>The device has been disconnected from the host.</description>
                                        <value>0x1</value>
                                    </enumeratedValue>
                                </enumeratedValues>
                            </field>
                    </fields>
                </register>
                <register>
                    <name>USBFS0_USBIE</name>
                    <description>USB General Interrupt Enable</description>
                    <addressOffset>0x200B</addressOffset>
                    <size>8</size>
                    <resetValue>0x00000006</resetValue>
                    <resetMask>0x000000ff</resetMask>
                    <fields>
                        <field>
                            <name>SUSPEND</name>
                            <description>Interrupt enable for SUSPEND signaling detected.
Note: Only valid in Peripheral mode.</description>
                            <bitOffset>0x0</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>read-only</access>
                            <enumeratedValues>
                                    <enumeratedValue>
                                        <name>DISABLE</name>
                                        <description>The SUSPEND interrupt is suppressed and not sent to the interrupt controller.</description>
                                        <value>0x0</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>ENABLE</name>
                                        <description>An interrupt is sent to the interrupt controller when the DISCON bit in the USBIS register is set.</description>
                                        <value>0x1</value>
                                    </enumeratedValue>
                                </enumeratedValues>
                            </field>
                        <field>
                            <name>RESUME</name>
                            <description>Interrupt enable for RESUME signaling detected.</description>
                            <bitOffset>0x1</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>read-write</access>
                            <enumeratedValues>
                                    <enumeratedValue>
                                        <name>DISABLE</name>
                                        <description>The RESUME interrupt is suppressed and not sent to the interrupt controller.</description>
                                        <value>0x0</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>ENABLE</name>
                                        <description>An interrupt is sent to the interrupt controller when the RESUME bit in the USBIS register is set.</description>
                                        <value>0x1</value>
                                    </enumeratedValue>
                                </enumeratedValues>
                            </field>
                        <field>
                            <name>RESETBABBLE</name>
                            <description>Interrupt enable for RESET/BABBLE signaling detected.</description>
                            <bitOffset>0x2</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>read-write</access>
                            <enumeratedValues>
                                    <enumeratedValue>
                                        <name>DSIABLE</name>
                                        <description>The RESET interrupt is suppressed and not sent to the interrupt controller.</description>
                                        <value>0x0</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>ENABLE</name>
                                        <description>An interrupt is sent to the interrupt controller when the RESET bit in the USBIS register is set.</description>
                                        <value>0x1</value>
                                    </enumeratedValue>
                                </enumeratedValues>
                            </field>
                        <field>
                            <name>SOF</name>
                            <description>Interrupt enable for Start of frame.</description>
                            <bitOffset>0x3</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>read-write</access>
                            <enumeratedValues>
                                    <enumeratedValue>
                                        <name>DISABLE</name>
                                        <description>The SOF interrupt is suppressed and not sent to the interrupt controller.</description>
                                        <value>0x0</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>ENABLE</name>
                                        <description>An interrupt is sent to the interrupt controller when the SOF bit in the USBIS register is set.</description>
                                        <value>0x1</value>
                                    </enumeratedValue>
                                </enumeratedValues>
                            </field>
                        <field>
                            <name>CONN</name>
                            <description>Interrupt enable for connect detected.
Note: Only valid in Host mode. Valid at all transaction speeds.</description>
                            <bitOffset>0x4</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>read-write</access>
                            <enumeratedValues>
                                    <enumeratedValue>
                                        <name>DISABLE</name>
                                        <description>The CONN interrupt is suppressed and not sent to the interrupt controller.</description>
                                        <value>0x0</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>ENABLE</name>
                                        <description>An interrupt is sent to the interrupt controller when the CONN bit in the USBIS register is set.</description>
                                        <value>0x1</value>
                                    </enumeratedValue>
                                </enumeratedValues>
                            </field>
                        <field>
                            <name>DISCON</name>
                            <description>Interrupt enable for session disconnect.</description>
                            <bitOffset>0x5</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>read-write</access>
                            <enumeratedValues>
                                    <enumeratedValue>
                                        <name>DISABLE</name>
                                        <description>The DISCON interrupt is suppressed and not sent to the interrupt controller.</description>
                                        <value>0x0</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>ENABLE</name>
                                        <description>An interrupt is sent to the interrupt controller when the DISCON bit in the USBIS register is set.</description>
                                        <value>0x1</value>
                                    </enumeratedValue>
                                </enumeratedValues>
                            </field>
                    </fields>
                </register>
