mspm0-rs/mspm0-data-sources/svd/MSPM0G511X.svd
                <register>
                    <name>USBFS0_FRAME</name>
                    <description>USB Last Received Frame Number</description>
                    <addressOffset>0x200C</addressOffset>
                    <size>16</size>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0x0000ffff</resetMask>
                    <fields>
                        <field>
                            <name>FRAME</name>
                            <description>Frame Number</description>
                            <bitOffset>0x0</bitOffset>
                            <bitWidth>0xB</bitWidth>
                            <access>read-only</access>
                            </field>
                    </fields>
                </register>
                <register>
                    <name>USBFS0_EPINDEX</name>
                    <description>USB Endpoint Index</description>
                    <addressOffset>0x200E</addressOffset>
                    <size>8</size>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0x000000ff</resetMask>
                    <fields>
                        <field>
                            <name>EPIDX</name>
                            <description>Endpoint Index.  #br#This bit field configures which endpoint is accessed when reading or writing to one of the USB controller's indexed registers. A value of 0x0 corresponds to Endpoint 0 and a value of 0xF corresponds to Endpoint 15.</description>
                            <bitOffset>0x0</bitOffset>
                            <bitWidth>0x4</bitWidth>
                            <access>read-write</access>
                            <enumeratedValues>
                                    <enumeratedValue>
                                        <name>EP0</name>
                                        <description>Select EP0 as indexed register</description>
                                        <value>0x0</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>EP1</name>
                                        <description>Select EP1 as indexed register</description>
                                        <value>0x1</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>EP2</name>
                                        <description>Select EP2 as indexed register</description>
                                        <value>0x2</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>EP3</name>
                                        <description>Select EP3 as indexed register</description>
                                        <value>0x3</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>EP4</name>
                                        <description>Select EP4 as indexed register</description>
                                        <value>0x4</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>EP5</name>
                                        <description>Select EP5 as indexed register</description>
                                        <value>0x5</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>EP6</name>
                                        <description>Select EP6 as indexed register</description>
                                        <value>0x6</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>EP7</name>
                                        <description>Select EP7 as indexed register</description>
                                        <value>0x7</value>
                                    </enumeratedValue>
                                </enumeratedValues>
                            </field>
                    </fields>
                </register>
                <register>
                    <name>USBFS0_TESTMODE</name>
                    <description>USB Test Mode</description>
                    <addressOffset>0x200F</addressOffset>
                    <size>8</size>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0x000000ff</resetMask>
                    <fields>
                        <field>
                            <name>FORCEFS</name>
                            <description>Force Full Speed Upon Reset.
The CPU sets this bit either in conjunction with bit 7 (FORCEH) or to force the USB controller into Full-speed mode when it receives a USB reset.</description>
                            <bitOffset>0x5</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>read-write</access>
                            <enumeratedValues>
                                    <enumeratedValue>
                                        <name>LOW</name>
                                        <description>The USB controller operates at Low Speed.</description>
                                        <value>0x0</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>FULL</name>
                                        <description>Forces the USB controller into Full-Speed mode upon receiving a USB RESET.</description>
                                        <value>0x1</value>
                                    </enumeratedValue>
                                </enumeratedValues>
                            </field>
                        <field>
                            <name>FIFOACC</name>
                            <description>FIFO Access.
The CPU sets this bit to transfer the packet in the Endpoint 0 TX FIFO to the Endpoint 0 Rx FIFO. 
Note: It is cleared automatically.</description>
                            <bitOffset>0x6</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>read-write</access>
                            <enumeratedValues>
                                    <enumeratedValue>
                                        <name>NO_EFFECT</name>
                                        <description>No effect</description>
                                        <value>0x0</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>EFFECT</name>
                                        <description>Transfers the packet in the endpoint 0 transmit FIFO to the endpoint 0 receive FIFO.</description>
                                        <value>0x1</value>
                                    </enumeratedValue>
                                </enumeratedValues>
                            </field>
                        <field>
                            <name>FORCEH</name>
                            <description>Force Host Mode.
The CPU sets this bit to instruct the core to enter Host mode when the Session bit is set, regardless of whether it is connected to any peripheral. The state of the CID input, HostDisconnect and LineState signals are ignored. The core will then remain in Host mode until the Session bit is cleared, even if a device is disconnected, and if the Force_Host bit remains set, will re-enter Host mode the next time the Session bit is set.
While in this mode, status of the bus connection may be read using the DEV bit of the USBDEVCTL register. The operating speed is determined from the FORCEFS bit.</description>
                            <bitOffset>0x7</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>read-write</access>
                            <enumeratedValues>
                                    <enumeratedValue>
                                        <name>NO_EFFECT</name>
                                        <description>No effect</description>
                                        <value>0x0</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>EFFECT</name>
                                        <description>Forces the USB controller to enter Host mode when the SESSION bit is set, regardless ofwhether the USB controller is connected to any peripheral. The state of the USB0DP and USB0DM signals is ignored. The USB controller then remains in Host mode until the SESSION #br#bit is cleared, even if a Device is disconnected. If the FORCEH bit remains set, the USB controller re-enters Host mode the next time the SESSION bit is set.</description>
                                        <value>0x1</value>
                                    </enumeratedValue>
                                </enumeratedValues>
                            </field>
                    </fields>
                </register>
                <register>
                    <name>USBFS0_IDXTXMAXP</name>
                    <description>Indexed TXMAP</description>
                    <addressOffset>0x2010</addressOffset>
                    <size>16</size>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0x00000000</resetMask>
                    <fields>
                    </fields>
                </register>
                <register>
                    <name>USBFS0_IDXTXCSRL</name>
                    <description>Indexed TXCSRL</description>
                    <addressOffset>0x2012</addressOffset>
                    <size>8</size>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0x00000000</resetMask>
                    <fields>
                    </fields>
                </register>
                <register>
                    <name>USBFS0_IDXTXCSRH</name>
                    <description>Indexed TXCSRH</description>
                    <addressOffset>0x2013</addressOffset>
                    <size>8</size>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0x00000000</resetMask>
                    <fields>
                    </fields>
                </register>
                <register>
                    <name>USBFS0_IDXRXMAXP</name>
                    <description>Indexed RXMAXP</description>
                    <addressOffset>0x2014</addressOffset>
                    <size>16</size>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0x00000000</resetMask>
                    <fields>
                    </fields>
                </register>
                <register>
                    <name>USBFS0_IDXRXCSRL</name>
                    <description>Indexed RXCSRL</description>
                    <addressOffset>0x2016</addressOffset>
                    <size>8</size>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0x00000000</resetMask>
                    <fields>
                    </fields>
                </register>
                <register>
                    <name>USBFS0_IDXRXCSRH</name>
                    <description>Indexed RXCSRH</description>
                    <addressOffset>0x2017</addressOffset>
                    <size>8</size>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0x00000000</resetMask>
                    <fields>
                    </fields>
                </register>
                <register>
                    <name>USBFS0_IDXRXCOUNT</name>
                    <description>Indexed RXCOUNT</description>
                    <addressOffset>0x2018</addressOffset>
                    <size>16</size>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0x00000000</resetMask>
                    <fields>
                    </fields>
                </register>
                <register>
                    <name>USBFS0_IDXTXTYPE</name>
                    <description>Indexed TXTYPE</description>
                    <addressOffset>0x201A</addressOffset>
                    <size>8</size>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0x00000000</resetMask>
                    <fields>
                    </fields>
                </register>
                <register>
                    <name>USBFS0_IDXTXINTERVAL</name>
                    <description>Indexed TXINTERVAL</description>
                    <addressOffset>0x201B</addressOffset>
                    <size>8</size>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0x00000000</resetMask>
                    <fields>
                    </fields>
                </register>
                <register>
                    <name>USBFS0_IDXRXTYPE</name>
                    <description>Indexed RXTYPE</description>
                    <addressOffset>0x201C</addressOffset>
                    <size>8</size>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0x00000000</resetMask>
                    <fields>
                    </fields>
                </register>
                <register>
                    <name>USBFS0_IDXRXINTERVAL</name>
                    <description>Indexed RXINTERVAL</description>
                    <addressOffset>0x201D</addressOffset>
                    <size>8</size>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0x00000000</resetMask>
                    <fields>
                    </fields>
                </register>
                <register>
                    <name>USBFS0_IDXFIFOSZ</name>
                    <description>Indexed FIFOSZ</description>
                    <addressOffset>0x201F</addressOffset>
                    <size>8</size>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0x00000000</resetMask>
                    <fields>
                    </fields>
                </register>
                <register>
                    <dim>16</dim>
                    <dimIncrement>4</dimIncrement>
                    <dimArrayIndex>0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15</dimArrayIndex>
                    <name>USBFS0_FIFO[%s]</name>
                    <description>USB FIFO Endpoint [n]</description>
                    <addressOffset>0x2020</addressOffset>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xffffffff</resetMask>
                    <fields>
                    </fields>
                </register>
