mspm0-rs/mspm0-data-sources/svd/MSPM0G511X.svd
                <register>
                    <name>USBFS0_DEVCTL</name>
                    <description>USB Device Control</description>
                    <addressOffset>0x2060</addressOffset>
                    <size>8</size>
                    <resetValue>0x00000080</resetValue>
                    <resetMask>0x000000ff</resetMask>
                    <fields>
                        <field>
                            <name>SESSION</name>
                            <description>Session Start/End.
Host mode: This bit is set or cleared by the CPU to start or end a session.
Device mode: This bit is set/cleared by the USB controller when a session starts/ends. It is also set by the CPU to initiate the Session Request Protocol. When the USB controller is in Suspend mode, the bit may be cleared by the CPU to perform a software disconnect. 
Note: Clearing this bit when the core is not suspended will result in undefined behavior.</description>
                            <bitOffset>0x0</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>read-write</access>
                            <enumeratedValues>
                                    <enumeratedValue>
                                        <name>CLEAR</name>
                                        <description>When operating as a Host: #br#When cleared by software, this bit ends a session. #br# #br#When operating as a Device: #br#The USB controller has ended a session. When the USB controller is in SUSPEND mode, this bit may be cleared by software to perform a software disconnect.</description>
                                        <value>0x0</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>SET</name>
                                        <description>When operating as a Host: #br#When set by software, this bit starts a session. #br# #br#When operating as a Device: #br#The USB controller has started a session. When set by software, the Session Request Protocol is initiated. #br# #br#Clearing this bit when the USB controller is not suspended results in undefined behavior.</description>
                                        <value>0x1</value>
                                    </enumeratedValue>
                                </enumeratedValues>
                            </field>
                        <field>
                            <name>HOSTREQ</name>
                            <description>When set, the USB controller will initiate the Host Negotiation when Suspend mode is entered.  It is cleared when Host Negotiation is completed.</description>
                            <bitOffset>0x1</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>read-write</access>
                            <enumeratedValues>
                                    <enumeratedValue>
                                        <name>NO_EFFECT</name>
                                        <description>No effect</description>
                                        <value>0x0</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>EFFECT</name>
                                        <description>Initiates the Host Negotiation when SUSPENDmode is entered.</description>
                                        <value>0x1</value>
                                    </enumeratedValue>
                                </enumeratedValues>
                            </field>
                        <field>
                            <name>HOST</name>
                            <description>Host Mode.
This Read-only bit is set when the USB controller is acting as a Host.
Note: Only valid while a session is in progress.</description>
                            <bitOffset>0x2</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>read-only</access>
                            <enumeratedValues>
                                    <enumeratedValue>
                                        <name>DEVICE</name>
                                        <description>The USB controller is acting as a Device.</description>
                                        <value>0x0</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>HOST</name>
                                        <description>The USB controller is acting as a Host.</description>
                                        <value>0x1</value>
                                    </enumeratedValue>
                                </enumeratedValues>
                            </field>
                        <field>
                            <name>VUSB</name>
                            <description>VUSB / USB-PHY is powered.</description>
                            <bitOffset>0x3</bitOffset>
                            <bitWidth>0x2</bitWidth>
                            <access>read-only</access>
                            <enumeratedValues>
                                    <enumeratedValue>
                                        <name>NOT_POWERED</name>
                                        <description>VUSB / USB-PHY supply is detected as under 1.35V.</description>
                                        <value>0x0</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>POWERED</name>
                                        <description>VUSB / USB-PHY supply is detected as above 1.35V.</description>
                                        <value>0x3</value>
                                    </enumeratedValue>
                                </enumeratedValues>
                            </field>
                        <field>
                            <name>LSDEV</name>
                            <description>Low Speed Device Detected.
This Read-only bit is set when a low-speed device has been detected being connected to the port.
Note: Only valid in Host mode.</description>
                            <bitOffset>0x5</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>read-only</access>
                            <enumeratedValues>
                                    <enumeratedValue>
                                        <name>NO_DETCT</name>
                                        <description>A low-speed Device has not been detected on the port.</description>
                                        <value>0x0</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>DETCT</name>
                                        <description>A low-speed Device has been detected on the port.</description>
                                        <value>0x1</value>
                                    </enumeratedValue>
                                </enumeratedValues>
                            </field>
                        <field>
                            <name>FSDEV</name>
                            <description>Full Speed Device Detected.
This Read-only bit is set when a full-speed device has been detected being connected to the port. 
Note: Only valid in Host mode.</description>
                            <bitOffset>0x6</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>read-only</access>
                            <enumeratedValues>
                                    <enumeratedValue>
                                        <name>NO_DETCT</name>
                                        <description>A full-speed Device has not been detected on the port.</description>
                                        <value>0x0</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>DETCT</name>
                                        <description>A full-speed Device has been detected on the port.</description>
                                        <value>0x1</value>
                                    </enumeratedValue>
                                </enumeratedValues>
                            </field>
                        <field>
                            <name>DEV</name>
                            <description>Device Mode.
This Read-only bit indicates whether the USB controller is operating as the host mode or device mode. 
Note: Only valid while a session is in progress.</description>
                            <bitOffset>0x7</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>read-only</access>
                            <enumeratedValues>
                                    <enumeratedValue>
                                        <name>HOST</name>
                                        <description>The USB controller is operating in host mode.</description>
                                        <value>0x0</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>DEVICE</name>
                                        <description>The USB controller is operating in device mode.</description>
                                        <value>0x1</value>
                                    </enumeratedValue>
                                </enumeratedValues>
                            </field>
                    </fields>
                </register>
                <register>
                    <name>USBFS0_MISC</name>
                    <description>USB Miscellaneous Register</description>
                    <addressOffset>0x2061</addressOffset>
                    <size>8</size>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0x000000ff</resetMask>
                    <fields>
                        <field>
                            <name>RX_EDMA</name>
                            <description>Receive early DMA mode.</description>
                            <bitOffset>0x0</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>read-write</access>
                            <enumeratedValues>
                                    <enumeratedValue>
                                        <name>LATE</name>
                                        <description>Late mode: DMA_REQ signal for all OUT Endpoints will be de-asserted when MAXP bytes have been read to an endpoint.</description>
                                        <value>0x0</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>EARLY</name>
                                        <description>Early Mode: DMA_REQ signal for all OUT Endpoints will be de-asserted when MAXP-8 bytes have been read to an endpoint.</description>
                                        <value>0x1</value>
                                    </enumeratedValue>
                                </enumeratedValues>
                            </field>
                        <field>
                            <name>TX_EDMA</name>
                            <description>Transmit early DMA mode.</description>
                            <bitOffset>0x1</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>read-write</access>
                            <enumeratedValues>
                                    <enumeratedValue>
                                        <name>LATE</name>
                                        <description>Late mode: DMA_REQ signal for all IN Endpoints will be de-asserted when MAXP bytes have been written to an endpoint. This is late mode.</description>
                                        <value>0x0</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>EARLY</name>
                                        <description>Early mode: DMA_REQ signal for all IN Endpoints will be de-asserted when MAXP-8 bytes have been written to an endpoint. This is early mode.</description>
                                        <value>0x1</value>
                                    </enumeratedValue>
                                </enumeratedValues>
                            </field>
                    </fields>
                </register>
                <register>
                    <name>USBFS0_IDXTXFIFOSZ</name>
                    <description>Indexed USB Transmit Dynamic FIFO Sizing</description>
                    <addressOffset>0x2062</addressOffset>
                    <size>8</size>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0x000000ff</resetMask>
                    <fields>
                        <field>
                            <name>SIZE</name>
                            <description>Max Packet Size</description>
                            <bitOffset>0x0</bitOffset>
                            <bitWidth>0x4</bitWidth>
                            <access>read-write</access>
                            <enumeratedValues>
                                    <enumeratedValue>
                                        <name>BYTES_8</name>
                                        <description>FIFO size 8-byte</description>
                                        <value>0x0</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>BYTES_16</name>
                                        <description>FIFO size 16-byte</description>
                                        <value>0x1</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>BYTES_32</name>
                                        <description>FIFO size 32-byte</description>
                                        <value>0x2</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>BYTES_64</name>
                                        <description>FIFO size 64-byte</description>
                                        <value>0x3</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>BYTES_128</name>
                                        <description>FIFO size 128-byte</description>
                                        <value>0x4</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>BYTES_256</name>
                                        <description>FIFO size 256-byte</description>
                                        <value>0x5</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>BYTES_512</name>
                                        <description>FIFO size 512-byte</description>
                                        <value>0x6</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>BYTES_1024</name>
                                        <description>FIFO size 1024-byte</description>
                                        <value>0x7</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>BYTES_2048</name>
                                        <description>FIFO size 2048-byte</description>
                                        <value>0x8</value>
                                    </enumeratedValue>
                                </enumeratedValues>
                            </field>
                        <field>
                            <name>DPB</name>
                            <description>Double Packet Buffer Support</description>
                            <bitOffset>0x4</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>read-write</access>
                            <enumeratedValues>
                                    <enumeratedValue>
                                        <name>SIGLE</name>
                                        <description>Single packet buffering is supported.</description>
                                        <value>0x0</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>DOUBLE</name>
                                        <description>Double packet buffering is enabled.</description>
                                        <value>0x1</value>
                                    </enumeratedValue>
                                </enumeratedValues>
                            </field>
                    </fields>
                </register>
                <register>
                    <name>USBFS0_IDXRXFIFOSZ</name>
                    <description>Indexed USB Receive Dynamic FIFO Sizing</description>
                    <addressOffset>0x2063</addressOffset>
                    <size>8</size>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0x000000ff</resetMask>
                    <fields>
                        <field>
                            <name>SIZE</name>
                            <description>Maximum packet size to be allowed. If DPB = 0, the FIFO also is this size; if DPB = 1, the FIFO is twice this size. Packet size in bytes:</description>
                            <bitOffset>0x0</bitOffset>
                            <bitWidth>0x4</bitWidth>
                            <access>read-write</access>
                            <enumeratedValues>
                                    <enumeratedValue>
                                        <name>BYTES_8</name>
                                        <description>FIFO size 8-byte</description>
                                        <value>0x0</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>BYTES_16</name>
                                        <description>FIFO size 16-byte</description>
                                        <value>0x1</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>BYTES_32</name>
                                        <description>FIFO size 32-byte</description>
                                        <value>0x2</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>BYTES_64</name>
                                        <description>FIFO size 64-byte</description>
                                        <value>0x3</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>BYTES_128</name>
                                        <description>FIFO size 128-byte</description>
                                        <value>0x4</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>BYTES_256</name>
                                        <description>FIFO size 256-byte</description>
                                        <value>0x5</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>BYTES_512</name>
                                        <description>FIFO size 512-byte</description>
                                        <value>0x6</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>BYTES_1024</name>
                                        <description>FIFO size 1024-byte</description>
                                        <value>0x7</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>BYTES_2048</name>
                                        <description>FIFO size 2048-byte</description>
                                        <value>0x8</value>
                                    </enumeratedValue>
                                </enumeratedValues>
                            </field>
                        <field>
                            <name>DPB</name>
                            <description>Double Packet Buffer Support</description>
                            <bitOffset>0x4</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>read-write</access>
                            <enumeratedValues>
                                    <enumeratedValue>
                                        <name>SIGLE</name>
                                        <description>Single packet buffering is supported.</description>
                                        <value>0x0</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>DOUBLE</name>
                                        <description>Double packet buffering is enabled.</description>
                                        <value>0x1</value>
                                    </enumeratedValue>
                                </enumeratedValues>
                            </field>
                    </fields>
                </register>
