mspm0-rs/mspm0-data-sources/svd/MSPM0G511X.svd
                                    <enumeratedValue>
                                        <name>ADDR_1240</name>
                                        <description>1240.0</description>
                                        <value>0x9B</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>ADDR_1248</name>
                                        <description>1248.0</description>
                                        <value>0x9C</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>ADDR_1256</name>
                                        <description>1256.0</description>
                                        <value>0x9D</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>ADDR_1264</name>
                                        <description>1264.0</description>
                                        <value>0x9E</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>ADDR_1272</name>
                                        <description>1272.0</description>
                                        <value>0x9F</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>ADDR_1280</name>
                                        <description>1280.0</description>
                                        <value>0xA0</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>ADDR_1288</name>
                                        <description>1288.0</description>
                                        <value>0xA1</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>ADDR_1296</name>
                                        <description>1296.0</description>
                                        <value>0xA2</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>ADDR_1304</name>
                                        <description>1304.0</description>
                                        <value>0xA3</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>ADDR_1312</name>
                                        <description>1312.0</description>
                                        <value>0xA4</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>ADDR_1320</name>
                                        <description>1320.0</description>
                                        <value>0xA5</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>ADDR_1328</name>
                                        <description>1328.0</description>
                                        <value>0xA6</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>ADDR_1336</name>
                                        <description>1336.0</description>
                                        <value>0xA7</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>ADDR_1344</name>
                                        <description>1344.0</description>
                                        <value>0xA8</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>ADDR_1352</name>
                                        <description>1352.0</description>
                                        <value>0xA9</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>ADDR_1360</name>
                                        <description>1360.0</description>
                                        <value>0xAA</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>ADDR_1368</name>
                                        <description>1368.0</description>
                                        <value>0xAB</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>ADDR_1376</name>
                                        <description>1376.0</description>
                                        <value>0xAC</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>ADDR_1384</name>
                                        <description>1384.0</description>
                                        <value>0xAD</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>ADDR_1392</name>
                                        <description>1392.0</description>
                                        <value>0xAE</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>ADDR_1400</name>
                                        <description>1400.0</description>
                                        <value>0xAF</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>ADDR_1408</name>
                                        <description>1408.0</description>
                                        <value>0xB0</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>ADDR_1416</name>
                                        <description>1416.0</description>
                                        <value>0xB1</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>ADDR_1424</name>
                                        <description>1424.0</description>
                                        <value>0xB2</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>ADDR_1432</name>
                                        <description>1432.0</description>
                                        <value>0xB3</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>ADDR_1440</name>
                                        <description>1440.0</description>
                                        <value>0xB4</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>ADDR_1448</name>
                                        <description>1448.0</description>
                                        <value>0xB5</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>ADDR_1456</name>
                                        <description>1456.0</description>
                                        <value>0xB6</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>ADDR_1464</name>
                                        <description>1464.0</description>
                                        <value>0xB7</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>ADDR_1472</name>
                                        <description>1472.0</description>
                                        <value>0xB8</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>ADDR_1480</name>
                                        <description>1480.0</description>
                                        <value>0xB9</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>ADDR_1488</name>
                                        <description>1488.0</description>
                                        <value>0xBA</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>ADDR_1496</name>
                                        <description>1496.0</description>
                                        <value>0xBB</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>ADDR_1504</name>
                                        <description>1504.0</description>
                                        <value>0xBC</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>ADDR_1512</name>
                                        <description>1512.0</description>
                                        <value>0xBD</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>ADDR_1520</name>
                                        <description>1520.0</description>
                                        <value>0xBE</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>ADDR_1528</name>
                                        <description>1528.0</description>
                                        <value>0xBF</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>ADDR_1536</name>
                                        <description>1536.0</description>
                                        <value>0xC0</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>ADDR_1544</name>
                                        <description>1544.0</description>
                                        <value>0xC1</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>ADDR_1552</name>
                                        <description>1552.0</description>
                                        <value>0xC2</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>ADDR_1560</name>
                                        <description>1560.0</description>
                                        <value>0xC3</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>ADDR_1568</name>
                                        <description>1568.0</description>
                                        <value>0xC4</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>ADDR_1576</name>
                                        <description>1576.0</description>
                                        <value>0xC5</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>ADDR_1584</name>
                                        <description>1584.0</description>
                                        <value>0xC6</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>ADDR_1592</name>
                                        <description>1592.0</description>
                                        <value>0xC7</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>ADDR_1600</name>
                                        <description>1600.0</description>
                                        <value>0xC8</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>ADDR_1608</name>
                                        <description>1608.0</description>
                                        <value>0xC9</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>ADDR_1616</name>
                                        <description>1616.0</description>
                                        <value>0xCA</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>ADDR_1624</name>
                                        <description>1624.0</description>
                                        <value>0xCB</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>ADDR_1632</name>
                                        <description>1632.0</description>
                                        <value>0xCC</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>ADDR_1640</name>
                                        <description>1640.0</description>
                                        <value>0xCD</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>ADDR_1648</name>
                                        <description>1648.0</description>
                                        <value>0xCE</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>ADDR_1656</name>
                                        <description>1656.0</description>
                                        <value>0xCF</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>ADDR_1664</name>
                                        <description>1664.0</description>
                                        <value>0xD0</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>ADDR_1672</name>
                                        <description>1672.0</description>
                                        <value>0xD1</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>ADDR_1680</name>
                                        <description>1680.0</description>
                                        <value>0xD2</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>ADDR_1688</name>
                                        <description>1688.0</description>
                                        <value>0xD3</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>ADDR_1696</name>
                                        <description>1696.0</description>
                                        <value>0xD4</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>ADDR_1704</name>
                                        <description>1704.0</description>
                                        <value>0xD5</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>ADDR_1712</name>
                                        <description>1712.0</description>
                                        <value>0xD6</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>ADDR_1720</name>
                                        <description>1720.0</description>
                                        <value>0xD7</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>ADDR_1728</name>
                                        <description>1728.0</description>
                                        <value>0xD8</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>ADDR_1736</name>
                                        <description>1736.0</description>
                                        <value>0xD9</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>ADDR_1744</name>
                                        <description>1744.0</description>
                                        <value>0xDA</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>ADDR_1752</name>
                                        <description>1752.0</description>
                                        <value>0xDB</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>ADDR_1760</name>
                                        <description>1760.0</description>
                                        <value>0xDC</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>ADDR_1768</name>
                                        <description>1768.0</description>
                                        <value>0xDD</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>ADDR_1776</name>
                                        <description>1776.0</description>
                                        <value>0xDE</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>ADDR_1784</name>
                                        <description>1784.0</description>
                                        <value>0xDF</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>ADDR_1792</name>
                                        <description>1792.0</description>
                                        <value>0xE0</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>ADDR_1800</name>
                                        <description>1800.0</description>
                                        <value>0xE1</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>ADDR_1808</name>
                                        <description>1808.0</description>
                                        <value>0xE2</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>ADDR_1816</name>
                                        <description>1816.0</description>
                                        <value>0xE3</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>ADDR_1824</name>
                                        <description>1824.0</description>
                                        <value>0xE4</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>ADDR_1832</name>
                                        <description>1832.0</description>
                                        <value>0xE5</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>ADDR_1840</name>
                                        <description>1840.0</description>
                                        <value>0xE6</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>ADDR_1848</name>
                                        <description>1848.0</description>
                                        <value>0xE7</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>ADDR_1856</name>
                                        <description>1856.0</description>
                                        <value>0xE8</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>ADDR_1864</name>
