mspm0-rs/mspm0-data-sources/svd/MSPM0G511X.svd
                                        <description>1864.0</description>
                                        <value>0xE9</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>ADDR_1872</name>
                                        <description>1872.0</description>
                                        <value>0xEA</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>ADDR_1880</name>
                                        <description>1880.0</description>
                                        <value>0xEB</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>ADDR_1888</name>
                                        <description>1888.0</description>
                                        <value>0xEC</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>ADDR_1896</name>
                                        <description>1896.0</description>
                                        <value>0xED</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>ADDR_1904</name>
                                        <description>1904.0</description>
                                        <value>0xEE</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>ADDR_1912</name>
                                        <description>1912.0</description>
                                        <value>0xEF</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>ADDR_1920</name>
                                        <description>1920.0</description>
                                        <value>0xF0</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>ADDR_1928</name>
                                        <description>1928.0</description>
                                        <value>0xF1</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>ADDR_1936</name>
                                        <description>1936.0</description>
                                        <value>0xF2</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>ADDR_1944</name>
                                        <description>1944.0</description>
                                        <value>0xF3</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>ADDR_1952</name>
                                        <description>1952.0</description>
                                        <value>0xF4</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>ADDR_1960</name>
                                        <description>1960.0</description>
                                        <value>0xF5</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>ADDR_1968</name>
                                        <description>1968.0</description>
                                        <value>0xF6</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>ADDR_1976</name>
                                        <description>1976.0</description>
                                        <value>0xF7</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>ADDR_1984</name>
                                        <description>1984.0</description>
                                        <value>0xF8</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>ADDR_1992</name>
                                        <description>1992.0</description>
                                        <value>0xF9</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>ADDR_2000</name>
                                        <description>2000.0</description>
                                        <value>0xFA</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>ADDR_2008</name>
                                        <description>2008.0</description>
                                        <value>0xFB</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>ADDR_2016</name>
                                        <description>2016.0</description>
                                        <value>0xFC</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>ADDR_2024</name>
                                        <description>2024.0</description>
                                        <value>0xFD</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>ADDR_2032</name>
                                        <description>2032.0</description>
                                        <value>0xFE</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>ADDR_2040</name>
                                        <description>2040.0</description>
                                        <value>0xFF</value>
                                    </enumeratedValue>
                                </enumeratedValues>
                            </field>
                    </fields>
                </register>
