mspm0-rs/mspm0-data-sources/svd/MSPM0G511X.svd
                                        <description>1864.0</description>
                                        <value>0xE9</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>ADDR_1872</name>
                                        <description>1872.0</description>
                                        <value>0xEA</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>ADDR_1880</name>
                                        <description>1880.0</description>
                                        <value>0xEB</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>ADDR_1888</name>
                                        <description>1888.0</description>
                                        <value>0xEC</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>ADDR_1896</name>
                                        <description>1896.0</description>
                                        <value>0xED</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>ADDR_1904</name>
                                        <description>1904.0</description>
                                        <value>0xEE</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>ADDR_1912</name>
                                        <description>1912.0</description>
                                        <value>0xEF</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>ADDR_1920</name>
                                        <description>1920.0</description>
                                        <value>0xF0</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>ADDR_1928</name>
                                        <description>1928.0</description>
                                        <value>0xF1</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>ADDR_1936</name>
                                        <description>1936.0</description>
                                        <value>0xF2</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>ADDR_1944</name>
                                        <description>1944.0</description>
                                        <value>0xF3</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>ADDR_1952</name>
                                        <description>1952.0</description>
                                        <value>0xF4</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>ADDR_1960</name>
                                        <description>1960.0</description>
                                        <value>0xF5</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>ADDR_1968</name>
                                        <description>1968.0</description>
                                        <value>0xF6</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>ADDR_1976</name>
                                        <description>1976.0</description>
                                        <value>0xF7</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>ADDR_1984</name>
                                        <description>1984.0</description>
                                        <value>0xF8</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>ADDR_1992</name>
                                        <description>1992.0</description>
                                        <value>0xF9</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>ADDR_2000</name>
                                        <description>2000.0</description>
                                        <value>0xFA</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>ADDR_2008</name>
                                        <description>2008.0</description>
                                        <value>0xFB</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>ADDR_2016</name>
                                        <description>2016.0</description>
                                        <value>0xFC</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>ADDR_2024</name>
                                        <description>2024.0</description>
                                        <value>0xFD</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>ADDR_2032</name>
                                        <description>2032.0</description>
                                        <value>0xFE</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>ADDR_2040</name>
                                        <description>2040.0</description>
                                        <value>0xFF</value>
                                    </enumeratedValue>
                                </enumeratedValues>
                            </field>
                    </fields>
                </register>
                <register>
                    <name>USBFS0_EPINFO</name>
                    <description>Endpoint Information</description>
                    <addressOffset>0x2078</addressOffset>
                    <size>8</size>
                    <access>read-only</access>
                    <resetValue>0x00000088</resetValue>
                    <resetMask>0x000000ff</resetMask>
                    <fields>
                        <field>
                            <name>TXENDPOINTS</name>
                            <description>The number of TX endpoints implemented in the design.</description>
                            <bitOffset>0x0</bitOffset>
                            <bitWidth>0x4</bitWidth>
                            <access>read-only</access>
                            </field>
                        <field>
                            <name>RXENDPOINTS</name>
                            <description>The number of Rx endpoints implemented in the design.</description>
                            <bitOffset>0x4</bitOffset>
                            <bitWidth>0x4</bitWidth>
                            <access>read-only</access>
                            </field>
                    </fields>
                </register>
                <register>
                    <name>USBFS0_RAMINFO</name>
                    <description>USB FIFO Buffer RAM Information</description>
                    <addressOffset>0x2079</addressOffset>
                    <size>8</size>
                    <access>read-only</access>
                    <resetValue>0x0000005c</resetValue>
                    <resetMask>0x000000ff</resetMask>
                    <fields>
                        <field>
                            <name>RAMBITS</name>
                            <description>The width of the RAM address bus.</description>
                            <bitOffset>0x0</bitOffset>
                            <bitWidth>0x4</bitWidth>
                            <access>read-only</access>
                            <enumeratedValues>
                                    <enumeratedValue>
                                        <name>RAM_1KB</name>
                                        <description>USB FIFO RAM size is 1kB</description>
                                        <value>0x8</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>RAM_2KB</name>
                                        <description>USB FIFO RAM size is 2kB</description>
                                        <value>0x9</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>RAM_4KB</name>
                                        <description>USB FIFO RAM size is 4kB</description>
                                        <value>0xA</value>
                                    </enumeratedValue>
                                </enumeratedValues>
                            </field>
                    </fields>
                </register>
                <register>
                    <name>USBFS0_CONTIM</name>
                    <description>USB Connect Timing</description>
                    <addressOffset>0x207A</addressOffset>
                    <size>8</size>
                    <resetValue>0x0000005c</resetValue>
                    <resetMask>0x000000ff</resetMask>
                    <fields>
                        <field>
                            <name>WTID</name>
                            <description>The wait ID field configures the delay required from the enable of the ID detection to when the ID value is valid, in units of 4.369 ms.
Note: The default corresponds to 52.43 ms.</description>
                            <bitOffset>0x0</bitOffset>
                            <bitWidth>0x4</bitWidth>
                            <access>read-write</access>
                            </field>
                        <field>
                            <name>WTCON</name>
                            <description>The connect wait field configures the wait required to allow for the user's connect/disconnect filter, in units of 533.3 ns.
Note: The default corresponds to 2.667 us.</description>
                            <bitOffset>0x4</bitOffset>
                            <bitWidth>0x4</bitWidth>
                            <access>read-write</access>
                            </field>
                    </fields>
                </register>
                <register>
                    <name>USBFS0_FSEOF</name>
                    <description>USB Full-Speed Last Transaction to End of Frame Timing</description>
                    <addressOffset>0x207D</addressOffset>
                    <size>8</size>
                    <resetValue>0x00000077</resetValue>
                    <resetMask>0x000000ff</resetMask>
                    <fields>
                    </fields>
                </register>
                <register>
                    <name>USBFS0_LSEOF</name>
                    <description>USB Low-Speed Last Transaction to End of Frame Timing</description>
                    <addressOffset>0x207E</addressOffset>
                    <size>8</size>
                    <resetValue>0x00000072</resetValue>
                    <resetMask>0x000000ff</resetMask>
                    <fields>
                    </fields>
                </register>
                <cluster>
                    <dim>16</dim>
                    <dimIncrement>8</dimIncrement>
                    <dimArrayIndex>0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15</dimArrayIndex>
                    <name>USBFS0_TADDR[%s]</name>
                    <description>USB Target Address Register for Endpoint [y]</description>
                    <addressOffset>0x2080</addressOffset>
                    <register>
                        <name>USBFS0_TXFUNCADDR</name>
                        <description>USB Transmit Functional Address Endpoint [n]</description>
                        <addressOffset>0x0</addressOffset>
                        <size>8</size>
                        <resetValue>0x00000000</resetValue>
                        <resetMask>0x000000ff</resetMask>
                        <fields>
                            <field>
                                <name>ADDR</name>
                                <description>Device Address specifies the USB bus address for the target Device.</description>
                                <bitOffset>0x0</bitOffset>
                                <bitWidth>0x7</bitWidth>
                                <access>read-write</access>
                                </field>
                        </fields>
                    </register>
                    <register>
                        <name>USBFS0_TXHUBADDR</name>
                        <description>USB Transmit Hub Address Endpoint [n]</description>
                        <addressOffset>0x2</addressOffset>
                        <size>8</size>
                        <resetValue>0x00000000</resetValue>
                        <resetMask>0x000000ff</resetMask>
                        <fields>
                            <field>
                                <name>ADDR</name>
                                <description>Device Address specifies the USB bus address for the target Device.</description>
                                <bitOffset>0x0</bitOffset>
                                <bitWidth>0x7</bitWidth>
                                <access>read-write</access>
                                </field>
                            <field>
                                <name>MULTTRAN</name>
                                <description>Record whether the hub has multiple transaction translators.</description>
                                <bitOffset>0x7</bitOffset>
                                <bitWidth>0x1</bitWidth>
                                <access>read-write</access>
                                <enumeratedValues>
                                        <enumeratedValue>
                                            <name>CLEAR</name>
                                            <description>Clear to indicate that the hub has a single transaction translator.</description>
                                            <value>0x0</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>SET</name>
                                            <description>Set to indicate that the hub has multiple transaction translators.</description>
                                            <value>0x1</value>
                                        </enumeratedValue>
                                    </enumeratedValues>
                                </field>
                        </fields>
                    </register>
                    <register>
                        <name>USBFS0_TXHUBPORT</name>
                        <description>USB Transmit Hub Port Endpoint [n]</description>
                        <addressOffset>0x3</addressOffset>
                        <size>8</size>
                        <resetValue>0x00000000</resetValue>
                        <resetMask>0x000000ff</resetMask>
                        <fields>
                            <field>
                                <name>ADDR</name>
                                <description>Hub Port specifies the USB hub port number.</description>
                                <bitOffset>0x0</bitOffset>
                                <bitWidth>0x7</bitWidth>
                                <access>read-write</access>
                                </field>
                        </fields>
                    </register>
                    <register>
                        <name>USBFS0_RXFUNCADDR</name>
                        <description>USB Receive Functional Address Endpoint [n]</description>
                        <addressOffset>0x4</addressOffset>
                        <size>8</size>
                        <resetValue>0x00000000</resetValue>
                        <resetMask>0x000000ff</resetMask>
                        <fields>
                            <field>
                                <name>ADDR</name>
                                <description>Device Address specifies the USB bus address for the target Device.</description>
                                <bitOffset>0x0</bitOffset>
                                <bitWidth>0x7</bitWidth>
                                <access>read-write</access>
                                </field>
                        </fields>
                    </register>
                    <register>
                        <name>USBFS0_RXHUBADDR</name>
                        <description>USB Receive Hub Address Endpoint [n]</description>
                        <addressOffset>0x6</addressOffset>
                        <size>8</size>
                        <resetValue>0x00000000</resetValue>
                        <resetMask>0x000000ff</resetMask>
                        <fields>
                            <field>
                                <name>ADDR</name>
                                <description>Hub Address</description>
                                <bitOffset>0x0</bitOffset>
                                <bitWidth>0x7</bitWidth>
                                <access>read-write</access>
                                </field>
                            <field>
                                <name>MULTTRAN</name>
                                <description>Record whether the hub has multiple transaction translators.</description>
                                <bitOffset>0x7</bitOffset>
                                <bitWidth>0x1</bitWidth>
                                <access>read-write</access>
                                <enumeratedValues>
                                        <enumeratedValue>
                                            <name>CLEAR</name>
                                            <description>Clear to indicate that the hub has a single transaction translator.</description>
                                            <value>0x0</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>SET</name>
                                            <description>Set to indicate that the hub has multiple transaction translators.</description>
                                            <value>0x1</value>
                                        </enumeratedValue>
                                    </enumeratedValues>
                                </field>
                        </fields>
                    </register>
                    <register>
                        <name>USBFS0_RXHUBPORT</name>
                        <description>USB Receive Hub Port Endpoint [n]</description>
                        <addressOffset>0x7</addressOffset>
                        <size>8</size>
                        <resetValue>0x00000000</resetValue>
                        <resetMask>0x000000ff</resetMask>
                        <fields>
                            <field>
                                <name>ADDR</name>
                                <description>Hub Address</description>
                                <bitOffset>0x0</bitOffset>
                                <bitWidth>0x7</bitWidth>
                                <access>read-write</access>
                                </field>
                        </fields>
                    </register>
                </cluster>
