mspm0-rs/mspm0-data-sources/svd/MSPM0G511X.svd
                <register>
                    <name>USBFS0_CONFIG</name>
                    <description>USB Config Data</description>
                    <addressOffset>0x210F</addressOffset>
                    <size>8</size>
                    <access>read-only</access>
                    <resetValue>0x00000006</resetValue>
                    <resetMask>0x000000ff</resetMask>
                    <fields>
                        <field>
                            <name>UTMIDATWDTH</name>
                            <description>Indicates selected UTMI+ data width. Always 0 indicating 8 bits.</description>
                            <bitOffset>0x0</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>read-only</access>
                            </field>
                        <field>
                            <name>SOFTCON</name>
                            <description>Always 1 . Indicates Soft Connect/Disconnect is enabled.</description>
                            <bitOffset>0x1</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>read-only</access>
                            </field>
                        <field>
                            <name>DYNFIFO</name>
                            <description>When set to 1 indicates Dynamic FIFO Sizing option selected.</description>
                            <bitOffset>0x2</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>read-only</access>
                            </field>
                        <field>
                            <name>HBTXE</name>
                            <description>When set to 1 indicates High-bandwidth TX ISO Endpoint Support selected.</description>
                            <bitOffset>0x3</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>read-only</access>
                            </field>
                        <field>
                            <name>HBRXE</name>
                            <description>When set to 1 indicates High-bandwidth Rx ISO Endpoint Support selected.</description>
                            <bitOffset>0x4</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>read-only</access>
                            </field>
                        <field>
                            <name>BIGENDIAN</name>
                            <description>Always '0'. Indicates Little Endian ordering.</description>
                            <bitOffset>0x5</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>read-only</access>
                            </field>
                        <field>
                            <name>MPTXE</name>
                            <description>When set to 1, automatic splitting of bulk packets is selected.</description>
                            <bitOffset>0x6</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>read-only</access>
                            </field>
                        <field>
                            <name>MPRXE</name>
                            <description>When set to 1, automatic amalgamation of bulk packets is selected.</description>
                            <bitOffset>0x7</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>read-only</access>
                            </field>
                    </fields>
                </register>
                <cluster>
                    <dim>15</dim>
                    <dimIncrement>16</dimIncrement>
                    <dimArrayIndex>0,1,2,3,4,5,6,7,8,9,10,11,12,13,14</dimArrayIndex>
                    <name>USBFS0_CSR[%s]</name>
                    <description>USB Control and Status Register for Endpoint [y]</description>
                    <addressOffset>0x2110</addressOffset>
                    <register>
                        <name>USBFS0_TXMAXP</name>
                        <description>USB Maximum Transmit Data Endpoint [n]</description>
                        <addressOffset>0x0</addressOffset>
                        <size>16</size>
                        <resetValue>0x00000000</resetValue>
                        <resetMask>0x0000ffff</resetMask>
                        <fields>
                            <field>
                                <name>MAXLOAD</name>
                                <description>Maximum Payload specifies the maximum payload in bytes per transaction.</description>
                                <bitOffset>0x0</bitOffset>
                                <bitWidth>0xB</bitWidth>
                                <access>read-write</access>
                                </field>
                        </fields>
                    </register>
                    <register>
                        <name>USBFS0_TXCSRL</name>
                        <description>USB Transmit Control and Status Endpoint [n] Low</description>
                        <addressOffset>0x2</addressOffset>
                        <size>8</size>
                        <resetValue>0x00000000</resetValue>
                        <resetMask>0x000000ff</resetMask>
                        <fields>
                            <field>
                                <name>TXRDY</name>
                                <description>Transmit Packet Ready.
The CPU sets this bit after loading a data packet into the FIFO. 
This bit is cleared automatically when a data packet has been transmitted. The EPn bit in the USBTXIS register is also set at this point. TXRDY is also automatically cleared prior to loading a second packet into a double-buffered FIFO.
Note: Host and device mode</description>
                                <bitOffset>0x0</bitOffset>
                                <bitWidth>0x1</bitWidth>
                                <access>read-write</access>
                                <enumeratedValues>
                                        <enumeratedValue>
                                            <name>WAIT</name>
                                            <description>No transmit packet is ready.</description>
                                            <value>0x0</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>READY</name>
                                            <description>Software sets this bit after loading a data packet into the TX FIFO.</description>
                                            <value>0x1</value>
                                        </enumeratedValue>
                                    </enumeratedValues>
                                </field>
                            <field>
                                <name>FIFONE</name>
                                <description>FIFO Not Empty.
The USB controller sets this bit when there is at least 1 packet in the TX FIFO.
Note: Host and device mode.</description>
                                <bitOffset>0x1</bitOffset>
                                <bitWidth>0x1</bitWidth>
                                <access>read-write</access>
                                <enumeratedValues>
                                        <enumeratedValue>
                                            <name>EMPTY</name>
                                            <description>The FIFO is empty</description>
                                            <value>0x0</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>NOT_EMPTY</name>
                                            <description>At least one packet is in the transmit FIFO.</description>
                                            <value>0x1</value>
                                        </enumeratedValue>
                                    </enumeratedValues>
                                </field>
                            <field>
                                <name>UNDRNERROR</name>
                                <description>Underrun / Error condition.
Device mode: The USB controller sets this bit if an IN token is received when TXRDY is not set. The CPU should clear this bit.
Host mode: The USB controller sets this bit when 3 attempts have been made to send a packet and no handshake packet has been received. When the bit is set, an interrupt is generated, TXRDY is cleared and the FIFO is completely flushed. The CPU should clear this bit. Valid only when the endpoint is operating in Bulk or Interrupt mode.</description>
                                <bitOffset>0x2</bitOffset>
                                <bitWidth>0x1</bitWidth>
                                <access>read-write</access>
                                <enumeratedValues>
                                        <enumeratedValue>
                                            <name>CLEAR</name>
                                            <description>No underrun or error condition</description>
                                            <value>0x0</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>SET</name>
                                            <description>Underrun or error condition exist.</description>
                                            <value>0x1</value>
                                        </enumeratedValue>
                                    </enumeratedValues>
                                </field>
                            <field>
                                <name>FLUSH</name>
                                <description>Flush FIFO.
The CPU writes a 1 to this bit to flush the latest packet from the endpoint TX FIFO. The FIFO pointer is reset, the TXRDY bit is cleared and an interrupt is generated. May be set simultaneously with TXRDY to abort the packet that is currently being loaded into the FIFO. 
Note: FLUSH should only be used when TXRDY is set. At other times, it may cause data to be corrupted. Also note that, if the FIFO is double-buffered, FLUSH may need to be set twice to completely clear the FIFO.
Note: Host and device mode.</description>
                                <bitOffset>0x3</bitOffset>
                                <bitWidth>0x1</bitWidth>
                                <access>read-write</access>
                                <enumeratedValues>
                                        <enumeratedValue>
                                            <name>NO_EFFECT</name>
                                            <description>No effect</description>
                                            <value>0x0</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>EFFECT</name>
                                            <description>Flushes the latest packet from the endpoint transmit FIFO.</description>
                                            <value>0x1</value>
                                        </enumeratedValue>
                                    </enumeratedValues>
                                </field>
                            <field>
                                <name>STALLSETUP</name>
                                <description>Send stall / Setup packet request.
Device mode: The CPU writes a 1 to this bit to issue a STALL handshake to an IN token. The CPU clears this bit to terminate the stall condition. Note: This bit has no effect where the endpoint is being used for Isochronous transfers.
Host mode: The CPU sets this bit, at the same time as the TXRDY bit is set, to send a SETUP token instead of an OUT token for the transaction. Note: Setting this bit also clears the USBTXCSRH.DT register.</description>
                                <bitOffset>0x4</bitOffset>
                                <bitWidth>0x1</bitWidth>
                                <access>read-write</access>
                                <enumeratedValues>
                                        <enumeratedValue>
                                            <name>CLEAR</name>
                                            <description>No effect</description>
                                            <value>0x0</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>SET</name>
                                            <description>Send stall or setup packet request.</description>
                                            <value>0x1</value>
                                        </enumeratedValue>
                                    </enumeratedValues>
                                </field>
                            <field>
                                <name>STALLED</name>
                                <description>Sent stall / RX stalled.
Device mode: This bit is set when a STALL handshake is transmitted. The FIFO is flushed and the TXRDY bit is cleared. The CPU should clear this bit.
Host mode: This bit is set when a STALL handshake is received. When this bit is set, any DMA request that is in progress is stopped, the FIFO is completely flushed and the TXRDY bit is cleared. The CPU should clear this bit.</description>
                                <bitOffset>0x5</bitOffset>
                                <bitWidth>0x1</bitWidth>
                                <access>read-write</access>
                                <enumeratedValues>
                                        <enumeratedValue>
                                            <name>CLEAR</name>
                                            <description>Clear stall indication.</description>
                                            <value>0x0</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>SET</name>
                                            <description>Indicates that a STALL handshake has been sent or received.</description>
                                            <value>0x1</value>
                                        </enumeratedValue>
                                    </enumeratedValues>
                                </field>
                            <field>
                                <name>CLRDT</name>
                                <description>Clear DataToggle.
The CPU writes a 1 to this bit to reset the endpoint data toggle to 0.
Note: Host and device mode.</description>
                                <bitOffset>0x6</bitOffset>
                                <bitWidth>0x1</bitWidth>
                                <access>read-write</access>
                                <enumeratedValues>
                                        <enumeratedValue>
                                            <name>NO_EFFECT</name>
                                            <description>No effect</description>
                                            <value>0x0</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>EFFECT</name>
                                            <description>Writing a 1 to this bit clears the DT bit in the USBTXCSRH[n] register.</description>
                                            <value>0x1</value>
                                        </enumeratedValue>
                                    </enumeratedValues>
                                </field>
                            <field>
                                <name>INCOMPNAKTO</name>
                                <description>Incomplete TX / NAK Timeout.
Device mode: When the endpoint is being used for high-bandwidth Isochronous, this bit is set to indicate where a large packet has been split into 2 or 3 packets for transmission but insufficient IN tokens have been received to send all the parts. Note: In anything other than isochronous transfers, this bit
will always return 0.
Host mode - bulk endpoints only: This bit will be set when the TX endpoint is halted following the receipt of NAK responses for longer than the time set as theTXPOLLNAKLMT by the TXINTERVAL register. The CPU should clear this bit to allow the endpoint to continue.
Host mode - high-bandwidth Interrupt endpoints only: This bit will be set if no response is received from the device to which the packet is being sent.</description>
                                <bitOffset>0x7</bitOffset>
                                <bitWidth>0x1</bitWidth>
                                <access>read-write</access>
                                <enumeratedValues>
                                        <enumeratedValue>
                                            <name>CLEAR</name>
                                            <description>No condition present / clear condition.</description>
                                            <value>0x0</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>SET</name>
                                            <description>Condition present.</description>
                                            <value>0x1</value>
                                        </enumeratedValue>
                                    </enumeratedValues>
                                </field>
                        </fields>
                    </register>
