mspm0-rs/mspm0-data-sources/svd/MSPM0G511X.svd
                    <register>
                        <name>USBFS0_TXCSRH</name>
                        <description>USB Transmit Control and Status Endpoint [n] High</description>
                        <addressOffset>0x3</addressOffset>
                        <size>8</size>
                        <resetValue>0x00000000</resetValue>
                        <resetMask>0x000000ff</resetMask>
                        <fields>
                            <field>
                                <name>DT</name>
                                <description>Data Toggle.
When read, this bit indicates the current state of the transmit endpoint data toggle.
If DTWE is High, this bit can be written with the required setting of the data toggle. If DTWE is Low, any value written to this bit is ignored. Care should be taken when writing to this bit as it should only be changed to RESET the transmit endpoint.
Note: Host mode only</description>
                                <bitOffset>0x0</bitOffset>
                                <bitWidth>0x1</bitWidth>
                                <access>read-write</access>
                                <enumeratedValues>
                                        <enumeratedValue>
                                            <name>LOW</name>
                                            <description>Data toggle is low</description>
                                            <value>0x0</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>HIGH</name>
                                            <description>Data toggle is high</description>
                                            <value>0x1</value>
                                        </enumeratedValue>
                                    </enumeratedValues>
                                </field>
                            <field>
                                <name>DTWE</name>
                                <description>Data Toggle Write Enable. 
The CPU writes a 1 to this bit to enable the current state of the TX Endpoint data toggle to be
written. This bit is automatically cleared once the new value is written.
Note: Host mode only.</description>
                                <bitOffset>0x1</bitOffset>
                                <bitWidth>0x1</bitWidth>
                                <access>read-write</access>
                                <enumeratedValues>
                                        <enumeratedValue>
                                            <name>DISABLE</name>
                                            <description>The DT bit cannot be written.</description>
                                            <value>0x0</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>ENABLE</name>
                                            <description>Enables the current state of the transmit endpoint data to be written (see DT bit).</description>
                                            <value>0x1</value>
                                        </enumeratedValue>
                                    </enumeratedValues>
                                </field>
                            <field>
                                <name>DMAMOD</name>
                                <description>DMA Request Mode.
The CPU sets this bit to select DMA Request Mode 1 and clears it to select DMA Request Mode 0.
Note: This bit must not be cleared either before or in the same cycle as the DMAEN bit is cleared.
Note: Device and host mode.</description>
                                <bitOffset>0x2</bitOffset>
                                <bitWidth>0x1</bitWidth>
                                <access>read-write</access>
                                <enumeratedValues>
                                        <enumeratedValue>
                                            <name>MODE0</name>
                                            <description>An interrupt is generated after every DMA packet transfer.</description>
                                            <value>0x0</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>MODE1</name>
                                            <description>An interrupt is generated only after the entire DMA transfer is complete.</description>
                                            <value>0x1</value>
                                        </enumeratedValue>
                                    </enumeratedValues>
                                </field>
                            <field>
                                <name>FDT</name>
                                <description>Force Data Toggle.
The CPU sets this bit to force the endpoint DT bit to switch and the data packet to be cleared from the FIFO, regardless of whether an ACK was received. This can be used by Interrupt TX endpoints that are used to communicate rate feedback for Isochronous endpoints.
Note: This bit should only be set when the TXRDY bit is set. At other times, it may cause data to be corrupted.
Note: Device and host mode.</description>
                                <bitOffset>0x3</bitOffset>
                                <bitWidth>0x1</bitWidth>
                                <access>read-write</access>
                                <enumeratedValues>
                                        <enumeratedValue>
                                            <name>NO_EFFECT</name>
                                            <description>No effect</description>
                                            <value>0x0</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>EFFECT</name>
                                            <description>Forces data toggle</description>
                                            <value>0x1</value>
                                        </enumeratedValue>
                                    </enumeratedValues>
                                </field>
                            <field>
                                <name>DMAEN</name>
                                <description>DMA Request Enable
The CPU sets this bit to enable the DMA request for the TX endpoint.
Note: Four TX and four RX endpoints can be connected to the DMA module. If this bit is set for a particular endpoint, the TRIGATX, TRIGBTX, TRIGCTX, or TRIGDTX field in the USB DMA Select (USBDMASEL) register must be programmed correspondingly.
Note: Device and host mode.</description>
                                <bitOffset>0x4</bitOffset>
                                <bitWidth>0x1</bitWidth>
                                <access>read-write</access>
                                <enumeratedValues>
                                        <enumeratedValue>
                                            <name>DISABLE</name>
                                            <description>Disables the DMA request for the transmit endpoint.</description>
                                            <value>0x0</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>ENABLE</name>
                                            <description>Enables the DMA request for the transmit endpoint.</description>
                                            <value>0x1</value>
                                        </enumeratedValue>
                                    </enumeratedValues>
                                </field>
                            <field>
                                <name>MODE</name>
                                <description>Mode
The CPU sets this bit to enable the endpoint direction as TX, and clears the bit to enable it as Rx. 
Note: This bit only has an effect when the same endpoint FIFO is used for both transmit and receive transactions.
Note: Host and device mode.</description>
                                <bitOffset>0x5</bitOffset>
                                <bitWidth>0x1</bitWidth>
                                <access>read-write</access>
                                <enumeratedValues>
                                        <enumeratedValue>
                                            <name>RX</name>
                                            <description>Enables the endpoint direction as RX.</description>
                                            <value>0x0</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>TX</name>
                                            <description>Enables the endpoint direction as TX.</description>
                                            <value>0x1</value>
                                        </enumeratedValue>
                                    </enumeratedValues>
                                </field>
                            <field>
                                <name>ISO</name>
                                <description>Isochronous Transfers.
The CPU sets this bit to enable the TX endpoint for Isochronous transfers, and clears it to enable the TX endpoint for Bulk or Interrupt transfers. 
Note: This bit only has any effect in device mode. In host mode, it always returns zero.</description>
                                <bitOffset>0x6</bitOffset>
                                <bitWidth>0x1</bitWidth>
                                <access>read-write</access>
                                <enumeratedValues>
                                        <enumeratedValue>
                                            <name>BULK_INT_TRANSFER</name>
                                            <description>Enables the transmit endpoint for bulk or interrupt transfers.</description>
                                            <value>0x0</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>ISO_TRANSFER</name>
                                            <description>Enables the transmit endpoint for isochronous transfers.</description>
                                            <value>0x1</value>
                                        </enumeratedValue>
                                    </enumeratedValues>
                                </field>
                            <field>
                                <name>AUTOSET</name>
                                <description>Auto Set.
If the CPU sets this bit, the TXRDY bit will be be automatically set when data of the maximum packet size (value in USBTXMAXP[n]) is loaded into the transmit FIFO. If a packet of less than the maximum packet size is loaded, then the TXRDY bit must be set manually.
Note: Should not be set for either high-bandwidth Isochronous endpoints or high-bandwidth Interrupt endpoints.
Note: Device and host mode.</description>
                                <bitOffset>0x7</bitOffset>
                                <bitWidth>0x1</bitWidth>
                                <access>read-write</access>
                                <enumeratedValues>
                                        <enumeratedValue>
                                            <name>MANUAL</name>
                                            <description>The TXRDY bit must be set manually.</description>
                                            <value>0x0</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>AUTO</name>
                                            <description>The TXRDY bit is automatically set when maximum packet size is loaded into the TX FIFO.</description>
                                            <value>0x1</value>
                                        </enumeratedValue>
                                    </enumeratedValues>
                                </field>
                        </fields>
                    </register>
                    <register>
                        <name>USBFS0_RXMAXP</name>
                        <description>USB Maximum Receive Data Endpoint [n]</description>
                        <addressOffset>0x4</addressOffset>
                        <size>16</size>
                        <resetValue>0x00000000</resetValue>
                        <resetMask>0x0000ffff</resetMask>
                        <fields>
                            <field>
                                <name>MAXLOAD</name>
                                <description>Maximum Payload specifies the maximum payload in bytes per transaction.</description>
                                <bitOffset>0x0</bitOffset>
                                <bitWidth>0xB</bitWidth>
                                <access>read-write</access>
                                </field>
                        </fields>
                    </register>
