mspm0-rs/mspm0-data-sources/svd/MSPM0G511X.svd
                <register>
                    <name>USBFS0_TXDPKTBUFDIS</name>
                    <description>USB Transmit Double Packet Buffer Disable</description>
                    <addressOffset>0x2342</addressOffset>
                    <size>16</size>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0x0000ffff</resetMask>
                    <fields>
                        <field>
                            <name>EP1</name>
                            <description>EP1 TX Double Packet Buffer Disable</description>
                            <bitOffset>0x1</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>read-only</access>
                            <enumeratedValues>
                                    <enumeratedValue>
                                        <name>DISABLE</name>
                                        <description>Disables double-packet buffering.</description>
                                        <value>0x0</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>ENABLE</name>
                                        <description>Enables double-packet buffering.</description>
                                        <value>0x1</value>
                                    </enumeratedValue>
                                </enumeratedValues>
                            </field>
                        <field>
                            <name>EP2</name>
                            <description>EP2 TX Double Packet Buffer Disable</description>
                            <bitOffset>0x2</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>read-only</access>
                            <enumeratedValues>
                                    <enumeratedValue>
                                        <name>DISABLE</name>
                                        <description>Disables double-packet buffering.</description>
                                        <value>0x0</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>ENABLE</name>
                                        <description>Enables double-packet buffering.</description>
                                        <value>0x1</value>
                                    </enumeratedValue>
                                </enumeratedValues>
                            </field>
                        <field>
                            <name>EP3</name>
                            <description>EP3 TX Double Packet Buffer Disable</description>
                            <bitOffset>0x3</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>read-only</access>
                            <enumeratedValues>
                                    <enumeratedValue>
                                        <name>DISABLE</name>
                                        <description>Disables double-packet buffering.</description>
                                        <value>0x0</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>ENABLE</name>
                                        <description>Enables double-packet buffering.</description>
                                        <value>0x1</value>
                                    </enumeratedValue>
                                </enumeratedValues>
                            </field>
                        <field>
                            <name>EP4</name>
                            <description>EP4 TX Double Packet Buffer Disable</description>
                            <bitOffset>0x4</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>read-only</access>
                            <enumeratedValues>
                                    <enumeratedValue>
                                        <name>DISABLE</name>
                                        <description>Disables double-packet buffering.</description>
                                        <value>0x0</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>ENABLE</name>
                                        <description>Enables double-packet buffering.</description>
                                        <value>0x1</value>
                                    </enumeratedValue>
                                </enumeratedValues>
                            </field>
                        <field>
                            <name>EP5</name>
                            <description>EP5 TX Double Packet Buffer Disable</description>
                            <bitOffset>0x5</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>read-only</access>
                            <enumeratedValues>
                                    <enumeratedValue>
                                        <name>DISABLE</name>
                                        <description>Disables double-packet buffering.</description>
                                        <value>0x0</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>ENABLE</name>
                                        <description>Enables double-packet buffering.</description>
                                        <value>0x1</value>
                                    </enumeratedValue>
                                </enumeratedValues>
                            </field>
                        <field>
                            <name>EP6</name>
                            <description>EP6 TX Double Packet Buffer Disable</description>
                            <bitOffset>0x6</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>read-only</access>
                            <enumeratedValues>
                                    <enumeratedValue>
                                        <name>DISABLE</name>
                                        <description>Disables double-packet buffering.</description>
                                        <value>0x0</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>ENABLE</name>
                                        <description>Enables double-packet buffering.</description>
                                        <value>0x1</value>
                                    </enumeratedValue>
                                </enumeratedValues>
                            </field>
                        <field>
                            <name>EP7</name>
                            <description>EP7 TX Double Packet Buffer Disable</description>
                            <bitOffset>0x7</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>read-only</access>
                            <enumeratedValues>
                                    <enumeratedValue>
                                        <name>DISABLE</name>
                                        <description>Disables double-packet buffering.</description>
                                        <value>0x0</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>ENABLE</name>
                                        <description>Enables double-packet buffering.</description>
                                        <value>0x1</value>
                                    </enumeratedValue>
                                </enumeratedValues>
                            </field>
                    </fields>
                </register>
