mspm0-rs/mspm0-data-sources/svd/MSPM0G511X.svd
                    <register>
                        <name>UC3_UART_DMA_TRIG_RX_MIS</name>
                        <description>Masked interrupt status</description>
                        <addressOffset>0x18</addressOffset>
                        <size>32</size>
                        <access>read-only</access>
                        <resetValue>0x00000000</resetValue>
                        <fields>
                            <field>
                                <name>RTOUT</name>
                                <description>Masked UARTOUT Receive Time-Out Interrupt.</description>
                                <bitOffset>0x0</bitOffset>
                                <bitWidth>0x1</bitWidth>
                                <enumeratedValues>
                                        <enumeratedValue>
                                            <name>CLR</name>
                                            <description>Interrupt did not occur</description>
                                            <value>0x0</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>SET</name>
                                            <description>Interrupt occurred</description>
                                            <value>0x1</value>
                                        </enumeratedValue>
                                    </enumeratedValues>
                                </field>
                            <field>
                                <name>RXINT</name>
                                <description>Masked UART Receive Interrupt.</description>
                                <bitOffset>0xA</bitOffset>
                                <bitWidth>0x1</bitWidth>
                                <enumeratedValues>
                                        <enumeratedValue>
                                            <name>CLR</name>
                                            <description>Interrupt did not occur</description>
                                            <value>0x0</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>SET</name>
                                            <description>Interrupt occurred</description>
                                            <value>0x1</value>
                                        </enumeratedValue>
                                    </enumeratedValues>
                                </field>
                        </fields>
                    </register>
                    <register>
                        <name>UC3_UART_DMA_TRIG_RX_ISET</name>
                        <description>Interrupt set</description>
                        <addressOffset>0x20</addressOffset>
                        <size>32</size>
                        <access>write-only</access>
                        <resetValue>0x00000000</resetValue>
                        <fields>
                            <field>
                                <name>RTOUT</name>
                                <description>Set UARTOUT Receive Time-Out Interrupt.</description>
                                <bitOffset>0x0</bitOffset>
                                <bitWidth>0x1</bitWidth>
                                <enumeratedValues>
                                        <enumeratedValue>
                                            <name>NO_EFFECT</name>
                                            <description>Writing 0 has no effect</description>
                                            <value>0x0</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>SET</name>
                                            <description>Set Interrupt</description>
                                            <value>0x1</value>
                                        </enumeratedValue>
                                    </enumeratedValues>
                                </field>
                            <field>
                                <name>RXINT</name>
                                <description>Set UART Receive Interrupt.</description>
                                <bitOffset>0xA</bitOffset>
                                <bitWidth>0x1</bitWidth>
                                <enumeratedValues>
                                        <enumeratedValue>
                                            <name>NO_EFFECT</name>
                                            <description>Writing 0 has no effect</description>
                                            <value>0x0</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>SET</name>
                                            <description>Set Interrupt</description>
                                            <value>0x1</value>
                                        </enumeratedValue>
                                    </enumeratedValues>
                                </field>
                        </fields>
                    </register>
                </cluster>
                <cluster>
                    <dim>1</dim>
                    <dimIncrement>36</dimIncrement>
                    <dimArrayIndex>0</dimArrayIndex>
                    <name>UC3_UART_DMA_TRIG_TX[%s]</name>
                    <description></description>
                    <addressOffset>0x1080</addressOffset>
                    <register>
                        <name>UC3_UART_DMA_TRIG_TX_IMASK</name>
                        <description>Interrupt mask</description>
                        <addressOffset>0x8</addressOffset>
                        <size>32</size>
                        <access>read-write</access>
                        <resetValue>0x00000000</resetValue>
                        <fields>
                            <field>
                                <name>TXINT</name>
                                <description>Enable UART Transmit Interrupt.</description>
                                <bitOffset>0xB</bitOffset>
                                <bitWidth>0x1</bitWidth>
                                <enumeratedValues>
                                        <enumeratedValue>
                                            <name>CLR</name>
                                            <description>Clear Interrupt Mask</description>
                                            <value>0x0</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>SET</name>
                                            <description>Set Interrupt Mask</description>
                                            <value>0x1</value>
                                        </enumeratedValue>
                                    </enumeratedValues>
                                </field>
                        </fields>
                    </register>
                    <register>
                        <name>UC3_UART_DMA_TRIG_TX_RIS</name>
                        <description>Raw interrupt status</description>
                        <addressOffset>0x10</addressOffset>
                        <size>32</size>
                        <access>read-only</access>
                        <fields>
                            <field>
                                <name>TXINT</name>
                                <description>UART Transmit Interrupt.</description>
                                <bitOffset>0xB</bitOffset>
                                <bitWidth>0x1</bitWidth>
                                <enumeratedValues>
                                        <enumeratedValue>
                                            <name>CLR</name>
                                            <description>Interrupt did not occur</description>
                                            <value>0x0</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>SET</name>
                                            <description>Interrupt occurred</description>
                                            <value>0x1</value>
                                        </enumeratedValue>
                                    </enumeratedValues>
                                </field>
                        </fields>
                    </register>
                    <register>
                        <name>UC3_UART_DMA_TRIG_TX_MIS</name>
                        <description>Masked interrupt status</description>
                        <addressOffset>0x18</addressOffset>
                        <size>32</size>
                        <access>read-only</access>
                        <resetValue>0x00000000</resetValue>
                        <fields>
                            <field>
                                <name>TXINT</name>
                                <description>Masked UART Transmit Interrupt.</description>
                                <bitOffset>0xB</bitOffset>
                                <bitWidth>0x1</bitWidth>
                                <enumeratedValues>
                                        <enumeratedValue>
                                            <name>CLR</name>
                                            <description>Interrupt did not occur</description>
                                            <value>0x0</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>SET</name>
                                            <description>Interrupt occurred</description>
                                            <value>0x1</value>
                                        </enumeratedValue>
                                    </enumeratedValues>
                                </field>
                        </fields>
                    </register>
                    <register>
                        <name>UC3_UART_DMA_TRIG_TX_ISET</name>
                        <description>Interrupt set</description>
                        <addressOffset>0x20</addressOffset>
                        <size>32</size>
                        <access>write-only</access>
                        <resetValue>0x00000000</resetValue>
                        <fields>
                            <field>
                                <name>TXINT</name>
                                <description>Set UART Transmit Interrupt.</description>
                                <bitOffset>0xB</bitOffset>
                                <bitWidth>0x1</bitWidth>
                                <enumeratedValues>
                                        <enumeratedValue>
                                            <name>NO_EFFECT</name>
                                            <description>Writing 0 has no effect</description>
                                            <value>0x0</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>SET</name>
                                            <description>Set Interrupt</description>
                                            <value>0x1</value>
                                        </enumeratedValue>
                                    </enumeratedValues>
                                </field>
                        </fields>
                    </register>
                </cluster>
                <register>
                    <name>UC3_UART_INTCTL</name>
                    <description>Interrupt control register</description>
                    <addressOffset>0x10E4</addressOffset>
                    <size>32</size>
                    <access>write-only</access>
                    <fields>
                        <field>
                            <name>INTEVAL</name>
                            <description>Writing a 1 to this field re-evaluates the interrupt sources.</description>
                            <bitOffset>0x0</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>write-only</access>
                            <enumeratedValues>
                                    <enumeratedValue>
                                        <name>DISABLE</name>
                                        <description>The interrupt or event line is disabled.</description>
                                        <value>0x0</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>EVAL</name>
                                        <description>The interrupt or event line is in software mode. Software must clear the RIS.</description>
                                        <value>0x1</value>
                                    </enumeratedValue>
                                </enumeratedValues>
                            </field>
                    </fields>
                </register>
