mspm0-rs/mspm0-data-sources/svd/MSPM0G511X.svd
                    <register>
                        <name>UC2_SPI_CPU_INT_RIS</name>
                        <description>Raw interrupt status</description>
                        <addressOffset>0x10</addressOffset>
                        <size>32</size>
                        <access>read-only</access>
                        <resetValue>0x00000000</resetValue>
                        <fields>
                            <field>
                                <name>RX</name>
                                <description>Receive event
When FIFO is present, this bit is set when FIFO threshold is reached
When FIFO is not present, this bit is set when a frame is received</description>
                                <bitOffset>0x2</bitOffset>
                                <bitWidth>0x1</bitWidth>
                                <enumeratedValues>
                                        <enumeratedValue>
                                            <name>CLR</name>
                                            <description>Interrupt did not occur</description>
                                            <value>0x0</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>SET</name>
                                            <description>Interrupt occurred</description>
                                            <value>0x1</value>
                                        </enumeratedValue>
                                    </enumeratedValues>
                                </field>
                            <field>
                                <name>TX</name>
                                <description>Transmit event
When FIFO is present, this bit is set when Tx FIFO threshold is reached
When FIFO is not present, this bit is set when tx buffer is empty</description>
                                <bitOffset>0x5</bitOffset>
                                <bitWidth>0x1</bitWidth>
                                <enumeratedValues>
                                        <enumeratedValue>
                                            <name>CLR</name>
                                            <description>Interrupt did not occur</description>
                                            <value>0x0</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>SET</name>
                                            <description>Interrupt occurred</description>
                                            <value>0x1</value>
                                        </enumeratedValue>
                                    </enumeratedValues>
                                </field>
                            <field>
                                <name>TXEMPTY</name>
                                <description>Transmit FIFO Empty interrupt mask. This interrupt is set if all data in the Transmit FIFO have been move to the shift register.</description>
                                <bitOffset>0x6</bitOffset>
                                <bitWidth>0x1</bitWidth>
                                <enumeratedValues>
                                        <enumeratedValue>
                                            <name>CLR</name>
                                            <description>Interrupt did not occur</description>
                                            <value>0x0</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>SET</name>
                                            <description>Interrupt occurred</description>
                                            <value>0x1</value>
                                        </enumeratedValue>
                                    </enumeratedValues>
                                </field>
                            <field>
                                <name>PER</name>
                                <description>Parity error event: this bit is set if a Parity error has been detected</description>
                                <bitOffset>0x0</bitOffset>
                                <bitWidth>0x1</bitWidth>
                                <enumeratedValues>
                                        <enumeratedValue>
                                            <name>CLR</name>
                                            <description>Interrupt did not occur</description>
                                            <value>0x0</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>SET</name>
                                            <description>Interrupt occurred</description>
                                            <value>0x1</value>
                                        </enumeratedValue>
                                    </enumeratedValues>
                                </field>
                            <field>
                                <name>RXFIFO_OVF</name>
                                <description>RXFIFO overflow event. This interrupt is set if an RX FIFO overflow has been detected.</description>
                                <bitOffset>0x1</bitOffset>
                                <bitWidth>0x1</bitWidth>
                                <enumeratedValues>
                                        <enumeratedValue>
                                            <name>CLR</name>
                                            <description>Interrupt did not occur</description>
                                            <value>0x0</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>SET</name>
                                            <description>Interrupt occurred</description>
                                            <value>0x1</value>
                                        </enumeratedValue>
                                    </enumeratedValues>
                                </field>
                            <field>
                                <name>IDLE</name>
                                <description>SPI has done finished transfers and changed into IDLE mode. This bit is set when BUSY goes low.</description>
                                <bitOffset>0x8</bitOffset>
                                <bitWidth>0x1</bitWidth>
                                <enumeratedValues>
                                        <enumeratedValue>
                                            <name>CLR</name>
                                            <description>Interrupt did not occur</description>
                                            <value>0x0</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>SET</name>
                                            <description>Interrupt occurred</description>
                                            <value>0x1</value>
                                        </enumeratedValue>
                                    </enumeratedValues>
                                </field>
                            <field>
                                <name>RTOUT</name>
                                <description>SPI Receive Time-Out event.
This bit is set when there is still contents in the FIFO after the timeout period</description>
                                <bitOffset>0x9</bitOffset>
                                <bitWidth>0x1</bitWidth>
                                <enumeratedValues>
                                        <enumeratedValue>
                                            <name>CLR</name>
                                            <description>Interrupt did not occur</description>
                                            <value>0x0</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>SET</name>
                                            <description>Interrupt occurred</description>
                                            <value>0x1</value>
                                        </enumeratedValue>
                                    </enumeratedValues>
                                </field>
                            <field>
                                <name>TXFIFO_UNF</name>
                                <description>TX FIFO Underflow Interrupt</description>
                                <bitOffset>0x4</bitOffset>
                                <bitWidth>0x1</bitWidth>
                                <enumeratedValues>
                                        <enumeratedValue>
                                            <name>CLR</name>
                                            <description>Interrupt did not occur</description>
                                            <value>0x0</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>SET</name>
                                            <description>Interrupt occurred</description>
                                            <value>0x1</value>
                                        </enumeratedValue>
                                    </enumeratedValues>
                                </field>
                            <field>
                                <name>RXFULL</name>
                                <description>RX FIFO Full Interrupt</description>
                                <bitOffset>0x3</bitOffset>
                                <bitWidth>0x1</bitWidth>
                                <enumeratedValues>
                                        <enumeratedValue>
                                            <name>CLR</name>
                                            <description>Interrupt did not occur</description>
                                            <value>0x0</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>SET</name>
                                            <description>Interrupt occurred</description>
                                            <value>0x1</value>
                                        </enumeratedValue>
                                    </enumeratedValues>
                                </field>
                            <field>
                                <name>DMA_DONE_RX</name>
                                <description>DMA Done on RX Event Channel Interrupt</description>
                                <bitOffset>0xF</bitOffset>
                                <bitWidth>0x1</bitWidth>
                                <enumeratedValues>
                                        <enumeratedValue>
                                            <name>CLR</name>
                                            <description>Interrupt disabled</description>
                                            <value>0x0</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>SET</name>
                                            <description>Interrupt occured</description>
                                            <value>0x1</value>
                                        </enumeratedValue>
                                    </enumeratedValues>
                                </field>
                            <field>
                                <name>DMA_DONE_TX</name>
                                <description>DMA Done on TX Event Channel Interrupt</description>
                                <bitOffset>0x10</bitOffset>
                                <bitWidth>0x1</bitWidth>
                                <enumeratedValues>
                                        <enumeratedValue>
                                            <name>CLR</name>
                                            <description>Interrupt disabled</description>
                                            <value>0x0</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>SET</name>
                                            <description>Interrupt occured</description>
                                            <value>0x1</value>
                                        </enumeratedValue>
                                    </enumeratedValues>
                                </field>
                            <field>
                                <name>LTOUT</name>
                                <description>SPI Line Time-Out event.
This bit is set after timeout period has lapsed</description>
                                <bitOffset>0x14</bitOffset>
                                <bitWidth>0x1</bitWidth>
                                <enumeratedValues>
                                        <enumeratedValue>
                                            <name>CLR</name>
                                            <description>Interrupt did not occur</description>
                                            <value>0x0</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>SET</name>
                                            <description>Interrupt occurred</description>
                                            <value>0x1</value>
                                        </enumeratedValue>
                                    </enumeratedValues>
                                </field>
                        </fields>
                    </register>
