mspm0-rs/mspm0-data-sources/svd/MSPM0G511X.svd
            </registers>
        </peripheral>
        <peripheral>
            <name>SPG0</name>
            <groupName>SPG</groupName>
            <version>1.0</version>
            <description>PERIPHERALREGION</description>
            <baseAddress>0x40A9F000</baseAddress>
            <addressBlock>
                <offset>0x0</offset>
                <size>0xA0C00</size>
                <usage>registers</usage>
            </addressBlock>
            <registers>
                <cluster>
                    <dim>1</dim>
                    <dimIncrement>4</dimIncrement>
                    <dimArrayIndex>0</dimArrayIndex>
                    <name>SPG0_UNICOMM_LPBK[%s]</name>
                    <description></description>
                    <addressOffset>0x1120</addressOffset>
                    <register>
                        <name>SPG0_LPBK0</name>
                        <description>Loopback between SPG instances
User has to ensure that the SPGs looped back have the same underlying IP instantiated; i.e. both UART, both SPI, both I2C, etc.,</description>
                        <addressOffset>0x0</addressOffset>
                        <size>32</size>
                        <access>read-write</access>
                        <fields>
                            <field>
                                <name>CONTROLLER</name>
                                <description>Select SPG controller for loopback. 
Signals invovled in loopback based on interface chosen
1. SPI : CS, SCLK, SDI, SDO 
2. I2C : SCL, SDA
3. UART : TX, RX</description>
                                <bitOffset>0x8</bitOffset>
                                <bitWidth>0x4</bitWidth>
                                <access>read-write</access>
                                <enumeratedValues>
                                        <enumeratedValue>
                                            <name>SPG1</name>
                                            <description>SPG commander select for loopback.</description>
                                            <value>0x0</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>SPG2</name>
                                            <description>SPG commander select for loopback.</description>
                                            <value>0x1</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>SPG3</name>
                                            <description>SPG commander select for loopback.</description>
                                            <value>0x2</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>SPG4</name>
                                            <description>SPG commander select for loopback.</description>
                                            <value>0x3</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>SPG5</name>
                                            <description>SPG commander select for loopback.</description>
                                            <value>0x4</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>SPG6</name>
                                            <description>SPG commander select for loopback.</description>
                                            <value>0x5</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>SPG7</name>
                                            <description>SPG commander select for loopback.</description>
                                            <value>0x6</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>SPG8</name>
                                            <description>SPG commander select for loopback.</description>
                                            <value>0x7</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>SPG9</name>
                                            <description>SPG commander select for loopback.</description>
                                            <value>0x8</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>SPG10</name>
                                            <description>SPG commander select for loopback.</description>
                                            <value>0x9</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>SPG11</name>
                                            <description>SPG commander select for loopback.</description>
                                            <value>0xA</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>SPG12</name>
                                            <description>SPG commander select for loopback.</description>
                                            <value>0xB</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>SPG13</name>
                                            <description>SPG commander select for loopback.</description>
                                            <value>0xC</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>SPG14</name>
                                            <description>SPG commander select for loopback.</description>
                                            <value>0xD</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>SPG15</name>
                                            <description>SPG commander select for loopback.</description>
                                            <value>0xE</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>SPG16</name>
                                            <description>SPG commander select for loopback.</description>
                                            <value>0xF</value>
                                        </enumeratedValue>
                                    </enumeratedValues>
                                </field>
                            <field>
                                <name>EN</name>
                                <description>Loopback  enable</description>
                                <bitOffset>0x0</bitOffset>
                                <bitWidth>0x1</bitWidth>
                                <access>read-write</access>
                                <enumeratedValues>
                                        <enumeratedValue>
                                            <name>DISABLE</name>
                                            <description>Does not select this clock as a source</description>
                                            <value>0x0</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>ENABLE</name>
                                            <description>Select this clock as a source</description>
                                            <value>0x1</value>
                                        </enumeratedValue>
                                    </enumeratedValues>
                                </field>
                            <field>
                                <name>PERIPHERAL</name>
                                <description>Select SPG peripheral for loopback. 
Signals invovled in loopback based on interface chosen
1. SPI : CS, SCLK, SDI, SDO 
2. I2C : SCL, SDA
3. UART : TX, RX</description>
                                <bitOffset>0xC</bitOffset>
                                <bitWidth>0x4</bitWidth>
                                <access>read-write</access>
                                <enumeratedValues>
                                        <enumeratedValue>
                                            <name>SPG1</name>
                                            <description>SPG responder select for loopback.</description>
                                            <value>0x0</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>SPG2</name>
                                            <description>SPG responder select for loopback.</description>
                                            <value>0x1</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>SPG3</name>
                                            <description>SPG responder select for loopback.</description>
                                            <value>0x2</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>SPG4</name>
                                            <description>SPG responder select for loopback.</description>
                                            <value>0x3</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>SPG5</name>
                                            <description>SPG responder select for loopback.</description>
                                            <value>0x4</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>SPG6</name>
                                            <description>SPG responder select for loopback.</description>
                                            <value>0x5</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>SPG7</name>
                                            <description>SPG responder select for loopback.</description>
                                            <value>0x6</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>SPG8</name>
                                            <description>SPG responder select for loopback.</description>
                                            <value>0x7</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>SPG9</name>
                                            <description>SPG responder select for loopback.</description>
                                            <value>0x8</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>SPG10</name>
                                            <description>SPG responder select for loopback.</description>
                                            <value>0x9</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>SPG11</name>
                                            <description>SPG responder select for loopback.</description>
                                            <value>0xA</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>SPG12</name>
                                            <description>SPG responder select for loopback.</description>
                                            <value>0xB</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>SPG13</name>
                                            <description>SPG responder select for loopback.</description>
                                            <value>0xC</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>SPG14</name>
                                            <description>SPG responder select for loopback.</description>
                                            <value>0xD</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>SPG15</name>
                                            <description>SPG responder select for loopback.</description>
                                            <value>0xE</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>SPG16</name>
                                            <description>SPG responder select for loopback.</description>
                                            <value>0xF</value>
                                        </enumeratedValue>
                                    </enumeratedValues>
                                </field>
                        </fields>
                    </register>
                </cluster>
